 {
  "1": [
    {
      "number": 1,
      "title": "Pilot",
      "description": "Straitlaced propane salesman and family man, Hank Hill, is accused of beating his son, Bobby, after Bobby gets a black eye from getting hit in the face with a baseball during a Little League game and rumors spread that Hank beat up a teenaged Megalo-Mart employee (when really he just yelled at him for not knowing if the store sells a tap and dye and some WD-40). Meanwhile, Hank's friends, cuckolded conspiracy nut Dale Gribble, down-and-out Army barber Bill Dauterive, and fast-talking womanizer Jeff Boomhauer, try to fix Hank's truck, while Luanne Platter (Hank's niece) moves in with the Hills after her trailer trash parents get sent to jail over a domestic disturbance."
    },
    {
      "number": 2,
      "title": "Square Peg",
      "description": "Peggy is mortified and tongue-tied when she finds out she has been chosen to teach the middle school's sexual education class, while Hank does everything he can to keep his son from learning about sex."
    },
    {
      "number": 3,
      "title": "The Order of the Straight Arrow",
      "description": "Hank, Bill, Dale, and Boomhauer take Bobby and his friends on an Order of the Straight Arrow camping trip where the men send the boys on a snipe hunt during which Bobby stuns a whooping crane but then everyone believes it is dead. Meanwhile, Peggy sneaks out to buy special shoes for her large feet."
    },
    {
      "number": 4,
      "title": "Hank's Got the Willies",
      "description": "Hank is worried that Bobby does not have a normal role model in his life—and things get worse when Bobby accidentally hits Hank's idol, Willie Nelson (voiced by Nelson himself) with a golf club during a day on the green."
    },
    {
      "number": 5,
      "title": "Luanne's Saga",
      "description": "When Buckley breaks up with Luanne and Luanne goes on a days-long crying jag, Hank sets out to find Luanne a new boyfriend in 48 hours—which backfires when Hank sees Luanne with Boomhauer. Chuck Mangione also guest stars."
    },
    {
      "number": 6,
      "title": "Hank's Unmentionable Problem",
      "description": "Hank's ongoing constipation causes great concern for Peggy and, much to Hank's embarrassment, everyone else in Arlen."
    },
    {
      "number": 7,
      "title": "Westie Side Story",
      "description": "When a new Laotian family moves in next door, problems ensue when the new neighbor's family dog goes missing and the Hills fear that the stereotype about Asians eating dogs is true."
    },
    {
      "number": 8,
      "title": "Shins of the Father",
      "description": "Hank's brash, sexist father, Cotton Hill, crashes Bobby's 12th birthday party—and stays over the Hills' house, which does not sit well with Peggy when Cotton's misogyny begins rubbing off on Bobby."
    },
    {
      "number": 9,
      "title": "Peggy the Boggle Champ",
      "description": "Hank's promise to coach Peggy at the Texas State Boggle Championship is jeopardized when his buddies try to lure him away to the Ninth Annual Dallas Mower Expo. Meanwhile, Bobby and Luanne freak out when they leave a condensation ring on the new coffee table, but their efforts to fix it cause even more trouble."
    },
    {
      "number": 10,
      "title": "Keeping Up with Our Joneses",
      "description": "When Hank catches Bobby smoking a cigarette in a gas station bathroom, Hank punishes him by making his son smoke an entire carton, but the plan backfires when Bobby, Hank, and Peggy all become addicted."
    },
    {
      "number": 11,
      "title": "King of the Ant Hill",
      "description": "After telling Dale never to spray insecticide on his lawn again, Hank's expensive new lawn becomes mysteriously infested with fire ants days before Rainey Street's Cinco de Mayo celebration. Meanwhile, Bobby becomes the hypnotized servant for the Red Ant Queen."
    },
    {
      "number": 12,
      "title": "Plastic White Female",
      "description": "Bobby is invited to his first boy/girl party, and Peggy is horrified when she discovers him playing Spin the Bottle with one of Luanne's plastic beauty school heads."
    }
  ],
  "2": [
    {
      "number": 1,
      "title": "How to Fire a Rifle Without Really Trying",
      "description": "When Bobby displays a talent for target shooting, Hank signs up for a father–son fun shoot competition—only to discover a buried childhood memory is still sadly affecting his aim."
    },
    {
      "number": 2,
      "title": "Texas City Twister",
      "description": "Hank must save Peggy and Luanne from a tornado after he regrets not showing remorse for throwing Luanne out of the house and moving her back to the trailer that she moved out of after her mother tried to kill her father."
    },
    {
      "number": 3,
      "title": "The Arrow Head",
      "description": "Peggy's excitement over finding Indian artifacts in the front yard distresses Hank when a condescending university professor tricks Peggy into letting him dig in the Hills' yard."
    },
    {
      "number": 4,
      "title": "Hilloween",
      "description": "Hank goes to war with a litigious Evangelical Christian woman (voice of Sally Field) bent on banning Halloween and indoctrinating the kids by inviting them to a hell house."
    },
    {
      "number": 5,
      "title": "Jumpin' Crack Bass (It's a Gas, Gas, Gas)",
      "description": "Hank finds himself facing possible jail time after mistakenly buying crack cocaine to use as fish bait and the only way out is to prove that crack cocaine can be useful as fish bait."
    },
    {
      "number": 6,
      "title": "Husky Bobby",
      "description": "Hank is determined to save his son from humiliation after Bobby decides to model for a husky boy clothing line."
    },
    {
      "number": 7,
      "title": "The Man Who Shot Cane Skretteberg",
      "description": "Hank, Boomhauer, Bill and Dale face off in a paintball war against the teenage members of a garage band (guest-voiced by the members of the pop-punk band Green Day)."
    },
    {
      "number": 8,
      "title": "The Son That Got Away",
      "description": "Bobby, Connie and Joseph run away to The Caves, where half of Arlen's unplanned pregnancies begin, after each of them gets in trouble at school for disrupting class."
    },
    {
      "number": 9,
      "title": "The Company Man",
      "description": "When a new housing development is in need of a propane supplier, Buck instructs Hank to show the owner, an obnoxious Northerner who acts like a Southerner, a good time. However, Hank is none too thrilled to learn that this will require him to act like a cowboy stereotype."
    },
    {
      "number": 10,
      "title": "Bobby Slam",
      "description": "Hank is delighted when Bobby announces he is joining the school wrestling team, but Peggy is mortified when she learns her son must first wrestle Connie in order to make the team."
    },
    {
      "number": 11,
      "title": "The Unbearable Blindness of Laying",
      "description": "In this first Christmas episode, Hank is psychologically shocked into blindness after accidentally catching a glimpse of his mother and her new Jewish boyfriend (voiced by Carl Reiner) having sex on Hank's kitchen table."
    },
    {
      "number": 12,
      "title": "Meet the Manger Babies",
      "description": "Hank faces a dilemma of Biblical proportions when Luanne asks him to portray God in a live TV broadcast of her Christian puppet show, which is scheduled to occur during Hank's beloved Super Bowl party."
    },
    {
      "number": 13,
      "title": "Snow Job",
      "description": "During a rare snowstorm in Texas, Buck Strickland has a heart attack and hires an incompetent worker to run his company while Hank is chosen to house-sit -- and Hank's world is shattered when he finds that Buck is only in the propane business for the cash and not the customer satisfaction."
    },
    {
      "number": 14,
      "title": "I Remember Mono",
      "description": "While updating files at Arlen High School, Peggy learns that Hank's two-week absence from classes during their high school days was due to mononucleosis, not a back injury, and is crushed that what was a romantic story of young love is now a lie."
    },
    {
      "number": 15,
      "title": "Three Days of the Kahndo",
      "description": "Kahn's misreading of an advertisement for a Mexican timeshare results in him, Hank, and Dale getting trapped in Mexico, while Luanne and Bobby try to hide some contraband beauty products."
    },
    {
      "number": 16,
      "title": "Traffic Jam",
      "description": "When Hank and Kahn collide with each other's cars, they are both forced to attend traffic school courses taught by a raunchy black comedian (voiced by Chris Rock), who begins mentoring Bobby in the art of stand-up -- and who begins mining material from racist websites."
    },
    {
      "number": 17,
      "title": "Hank's Dirty Laundry",
      "description": "While purchasing a new dryer, Hank discovers that his credit is bad, thanks to a video store clerk who accuses Hank of renting a pornographic video and never returning it."
    },
    {
      "number": 18,
      "title": "The Final Shinsult",
      "description": "After losing his driver's license, Cotton moves in with Dale and plots to steal Antonio López de Santa Anna's wooden leg from a museum to use as a bargaining chip with the DMV."
    },
    {
      "number": 19,
      "title": "Leanne's Saga",
      "description": "Luanne's alcoholic mother is released from prison and starts dating Bill, whom she begins to abuse."
    },
    {
      "number": 20,
      "title": "Junkie Business",
      "description": "Strickland Propane's new employee (whom Hank hired because he preferred a man over the qualified woman who applied) turns out to be a drug addict who uses a legal trick that frees him from responsibility on the job and from being fired. Meanwhile, Peggy fears that the woman Hank turned down for the job may be after Hank."
    },
    {
      "number": 21,
      "title": "Life in the Fast Lane, Bobby's Saga",
      "description": "Bobby gets a job as a concession boy at the Arlen race track, where he discovers that his boss is a mean man (voice of David Herman). Hank pays very little attention to Bobby's horror stories until he witnesses the mistreatment firsthand. Meanwhile, Boomhauer is given the chance to drive the pace car in an upcoming race."
    },
    {
      "number": 22,
      "title": "Peggy's Turtle Song",
      "description": "When Bobby is misdiagnosed with attention deficit disorder (after eating too much sugary cereal and disrupting class), Peggy quits her job as a substitute teacher and becomes a stay-at-home mom, but soon realizes that she needs a hobby for her newfound time and begins taking guitar lessons."
    },
    {
      "number": 23,
      "title": "Propane Boom",
      "description": "Part one of two. Strickland Propane experiences discontinuation from business after the wholesale of economical propane from Mega Lo Mart, rendering Hank unemployed and forcing him to collude in a plot to disrupt a publicity stunt."
    }
  ],
  "3": [
    {
      "number": 1,
      "title": "Death of a Propane Salesman",
      "description": "Conclusion. The aftermath of the propane explosion from part one leaves Hank suffering from post-traumatic stress disorder around propane, a now bald Luanne repressing her grief for Buckley (who was the only casualty in the propane explosion) by becoming a Sinéad O'Connor-esque activist while angry, and Bobby worried about death."
    },
    {
      "number": 2,
      "title": "And They Call It Bobby Love",
      "description": "Bobby falls in love with a 14-year-old classmate (guest-voiced by Sarah Michelle Gellar), but soon learns that love hurts when the girl confesses that she only wants a platonic friend. Meanwhile, Hank, Dale, Bill, and Boomhauer become attached to a couch that was thrown out in the Hills' yard."
    },
    {
      "number": 3,
      "title": "Peggy's Headache",
      "description": "Peggy gets hired to write for the Arlen Bystander, but the stress of a new career leads her to require treatment from John Redcorn—and she soon discovers that John Redcorn had an affair with Nancy and is Joseph's biological father."
    },
    {
      "number": 4,
      "title": "Pregnant Paws",
      "description": "While Hank is busy trying to breed Ladybird, Dale decides to add a little excitement to his life by enrolling in a four-hour bounty hunter training course."
    },
    {
      "number": 5,
      "title": "Next of Shin",
      "description": "After Hank learns his sperm count is low, his mood worsens when Cotton shows up, boasting that his new wife, Didi, is pregnant."
    },
    {
      "number": 6,
      "title": "Peggy's Pageant Fever",
      "description": "Peggy enters the Mrs. Heimlich County Beauty pageant in hopes of winning a truck, but quickly discovers that she is not fit to compete with the other contestants."
    },
    {
      "number": 7,
      "title": "Nine Pretty Darn Angry Men",
      "description": "While shopping at the mall on Black Friday, Hank, Dale, Bill, Kahn, and Boomhauer are invited to be part of a focus group for a new mower (with Cotton as an uninvited guest), Luanne goes ice skating to forget about Buckley, and Peggy falls asleep at a shoe repair shop after tearing her loafer. Guest stars Billy Bob Thornton."
    },
    {
      "number": 8,
      "title": "Good Hill Hunting",
      "description": "Hank takes Bobby hunting in order to initiate him into the mysteries of manhood. However, everything goes wrong when Hank discovers that it is too late for Bobby to get a hunting license."
    },
    {
      "number": 9,
      "title": "Pretty, Pretty Dresses",
      "description": "In this second Christmas episode, Bill becomes more depressed than usual as it's the anniversary of his wife leaving him. Hank, Dale, and Boomhauer decide to watch Bill in case he threatens to commit suicide, but when Hank yells at him for being a burden, Bill's depression turns into delusion when he begins dressing in drag and impersonating his estranged wife, Lenore."
    },
    {
      "number": 10,
      "title": "A Firefighting We Will Go",
      "description": "In a Rashomon-meets-The Three Stooges-style story, Hank, Dale, Bill, and Boomhauer tell their own versions of their day as firefighters after getting arrested for burning the firehouse to the ground. Meanwhile, Bobby helps Peggy with a pulled groin muscle."
    },
    {
      "number": 11,
      "title": "To Spank, with Love",
      "description": "Peggy gains a reputation as an abusive disciplinarian when she spanks Dooley for humiliating her during class."
    },
    {
      "number": 12,
      "title": "Three Coaches and a Bobby",
      "description": "Hank gets his hard-knocks former high-school football coach to take on guidance of Bobby's football team, but the plan falls apart when Bobby joins the soccer team headed by a politically correct coach (voiced by Will Ferrell)."
    },
    {
      "number": 13,
      "title": "De-Kahnstructing Henry",
      "description": "Hank accidentally gets Kahn fired after revealing one of Kahn's top-secret plans for his company."
    },
    {
      "number": 14,
      "title": "The Wedding of Bobby Hill",
      "description": "To teach Bobby and Luanne a lesson in playing pranks, Hank orders Bobby to marry Luanne after Bobby takes her birth control pills."
    },
    {
      "number": 15,
      "title": "Sleight of Hank",
      "description": "Peggy is chosen to be a magician's assistant, but angers Hank when she will not tell him the secret behind one of his tricks."
    },
    {
      "number": 16,
      "title": "Jon Vitti Presents: Return to La Grunta",
      "description": "Luanne gets a job as a drink girl at a resort called La Grunta, where the golfers sexually harass her. Meanwhile, Hank goes to La Grunta to swim with the dolphins—and gets molested by one of them, and is paid off with hotel merchandise to keep from reporting the incident."
    },
    {
      "number": 17,
      "title": "Escape from Party Island",
      "description": "Hank reluctantly drives his mother and her friends to Port Aransas to shop for glass miniatures, but things get even worse when Hank and the rude old women have to contend with MTV's raucous spring breakers in order to leave."
    },
    {
      "number": 18,
      "title": "Love Hurts...and So Does Art",
      "description": "An X-ray of Hank's colon from 'Hank's Unmentionable Problem' winds up as the main attraction in an art museum. Meanwhile, Bobby is diagnosed with gout after eating chicken livers at a recently opened 'New York' style deli."
    },
    {
      "number": 19,
      "title": "Hank's Cowboy Movie",
      "description": "Hurt by Bobby's negative views of his hometown, Hank tries to get the Dallas Cowboys to move their training camp from Wichita Falls to Arlen. However, his promotion video for Arlen is ruined by his wife's and his friends' incompetence."
    },
    {
      "number": 20,
      "title": "Dog Dale Afternoon",
      "description": "After Dale annoys his friends by gloating over his new mower, he goes insane when they steal it as part of a prank."
    },
    {
      "number": 21,
      "title": "Revenge of the Lutefisk",
      "description": "Bobby accidentally burns down his church after getting sick from eating lutefisk, but Cotton gets blamed for it due to his sexist attitude towards the church accepting a female pastor."
    },
    {
      "number": 22,
      "title": "Death and Texas",
      "description": "Peggy visits a convict who tricks her into thinking he's a former student who ended up in jail and uses her as a cocaine mule. Meanwhile, Dale tries to apply for a job as a prison executioner."
    },
    {
      "number": 23,
      "title": "Wings of the Dope",
      "description": "After seeing the trampoline Kahn bought from Buckley's estate fall into disrepair, Hank and the guys move it to Hank's lawn to fix it. Buckley's Angel appears on it and visits Luanne. He persuades her to do something better with her life than attend beauty school and earns his halo afterward."
    },
    {
      "number": 24,
      "title": "Take Me Out of the Ball Game",
      "description": "Hank is picked to coach the company's softball team, spurring friction between Peggy and Hank."
    },
    {
      "number": 25,
      "title": "As Old as the Hills...",
      "description": "Part one of two. Fearing that they may be getting too old to be 'cool', Hank and Peggy spend their anniversary sky-diving, which comes to an abrupt end when Peggy's parachute malfunctions and she crashes onto a field. Meanwhile, Bobby struggles with taking his pregnant step-grandmother Didi to the hospital when her water breaks."
    }
  ],
  "4": [
    {
      "number": 1,
      "title": "...Peggy Hill: The Decline and Fall",
      "description": "Conclusion. Peggy struggles to regain her strength following her skydiving accident. Meanwhile, Bobby delivers Cotton's son (whom Cotton names 'Good Hank') but gets overwhelmed when neither Cotton nor Didi embrace new parenthood."
    },
    {
      "number": 2,
      "title": "Cotton's Plot",
      "description": "Cotton takes over Peggy's physical therapy in exchange for help getting a burial plot in the Texas State Cemetery, but Peggy discovers a discrepancy about Cotton's service in the Army during World War II."
    },
    {
      "number": 3,
      "title": "Bills Are Made to Be Broken",
      "description": "Bill's high school football record is broken unfairly, and (largely at Hank's insistence) he tries to get back on the field to set things right."
    },
    {
      "number": 4,
      "title": "Little Horrors of Shop"	,
      "description": "Buck Strickland insists that Hank take two weeks off from Strickland Propane, and Hank begins teaching wood shop at Tom Landry Middle School, and becomes so popular that Peggy grows envious of him. However, Hank gets in trouble for violating the school's zero-tolerance policy on weapons when he asks his students to bring in tools from home."
    },
    {
      "number": 5,
      "title": "Aisle 8A",
      "description": "Kahn and Minh go to Hawaii for Kahn's job and asks Hank to take care of Connie, who's excited that she will be staying with Bobby, but becomes emotional and mean-spirited when she gets her first period, leaving an extremely uncomfortable Hank to both deal with the unstable Connie and have to explain 'the birds and the bees' to Bobby (who has no idea why Connie is so emotional)."
    },
    {
      "number": 6,
      "title": "A Beer Can Named Desire",
      "description": "Hank wins an Alamo Beer contest for a chance to win a million dollars by throwing a football through a one-foot hole in a giant Alamo Beer can, while Bill visits his eccentric Cajun relatives in Louisiana."
    },
    {
      "number": 7,
      "title": "The Hank's Giving Episode",
      "description": "The Hills plan to fly to Montana for Thanksgiving, but are stranded with their neighbors at the airport by a snowstorm."
    },
    {
      "number": 8,
      "title": "Not in My Back-hoe"	,
      "description": "Drew Carey guest stars as a man who befriends Hank Hill after the two discover that they are very much alike. Meanwhile, Bill and Dale steal Hank's backhoe and take it to a pet cemetery, with disastrous results."
    },
    {
      "number": 9,
      "title": "To Kill a Ladybird",
      "description": "Bobby befriends a wild raccoon, that may, or may not have infected Dale and Ladybird with rabies."
    },
    {
      "number": 10,
      "title": "Hillennium",
      "description": "As Christmas approaches, Hank gets irritated over everyone panicking about the supposed technological apocalypse that will purportedly happen on January 1, 2000, due to the Y2K computer date glitch—but soon finds himself trying to safeguard his family after a propane shortage."
    },
    {
      "number": 11,
      "title": "Old Glory",
      "description": "Peggy writes a school essay for Bobby, and they both catch fire for it by a vengeful English teacher who accuses them of plagiarism. Meanwhile, Bill buys an oversized flag from the Army that is very special to him, but causes problems to his neighbors."
    },
    {
      "number": 12,
      "title": "Rodeo Days",
      "description": "When the rodeo comes to Arlen, Bobby tries his hand at cattle roping; when he fails miserably, he takes his career in the other direction, choosing to become a rodeo clown, much to Hank and Peggy's dismay."
    },
    {
      "number": 13,
      "title": "Hanky Panky",
      "description": "Part one of two. Buck Strickland and his wife Miz Liz separate, and Buck dumps his secretary/mistress Debbie Grund (Reese Witherspoon) -- and Hank becomes an object of desire for Miz Liz while Debbie plots to murder Buck Strickland. Meanwhile, Peggy becomes the proprietor of Sugarfoot's Barbecue Restaurant and finds Debbie Grund's dead body in a Dumpster."
    },
    {
      "number": 14,
      "title": "High Anxiety",
      "description": "Conclusion. Peggy continues her experiment in running Sugarfoot's, while Hank inadvertently tries marijuana and becomes a person of interest in Debbie Grund's murder -- until a state trooper discovers the truth behind Debbie's death."
    },
    {
      "number": 15,
      "title": "Naked Ambition",
      "description": "After a day of swimming at the river, Bobby accidentally walks in on Luanne naked. When Joseph hears the story, his imagination runs wild and he wants to see her nude too—until Connie catches them peeping. Meanwhile, Boomhauer floats down a river and ends up in Houston, where he is committed to a mental hospital due to his unintelligible speech."
    },
    {
      "number": 16,
      "title": "Movin' on Up",
      "description": "Fed up with Hank's demands, Luanne moves out of the Hills' den—and into a house with a trio of even more aggravating college-aged deadbeats."
    },
    {
      "number": 17,
      "title": "Bill of Sales",
      "description": "Peggy reluctantly recruits Bill into a pyramid scheme and is pleasantly surprised by his superb sales abilities, but she's surprised when her for-once sincere praise for him leads to him being unable to sell anymore."
    },
    {
      "number": 18,
      "title": "Won't You Pimai Neighbor?",
      "description": "Bobby undergoes tests to find out if he is the reincarnation of the Buddhist Lama Sanglug, much to Hank's discomfort."
    },
    {
      "number": 19,
      "title": "Hank's Bad Hair Day",
      "description": "After Hank's barber is forced to retire on account of the scarcity of business, Hank gets a haircut on the Army base from Bill, and puts Bill out of the job after lodging a complaint to the government about a $900 bill for the tonsorial procedure."
    },
    {
      "number": 20,
      "title": "Meet the Propaniacs",
      "description": "While working for Hank during the summer at Strickland Propane (instead of going to an acting camp), Bobby, some Strickland co-workers, Dale, and Luanne form a sketch comedy troupe called The Propaniacs."
    },
    {
      "number": 21,
      "title": "Nancy's Boys",
      "description": "Nancy breaks off her adulterous affair with John Redcorn after going on a date with Dale and falling in love with him all over again."
    },
    {
      "number": 22,
      "title": "Flush with Power",
      "description": "Arlen's City Council forces Hank to install low-flow toilets against his wishes when a drought hits town. Hank's anger leads him to join the local zoning board, which he discovers is rife with corruption."
    },
    {
      "number": 23,
      "title": "Transnational Amusements Presents: Peggy's Magic Sex Feet",
      "description": "After admitting her real shoe size during a night of bowling and learning from a shoe salesman that she's a size 16-and-a-half and will hit a size 20 in a few years, Peggy feels ashamed of her big feet—until a self-proclaimed 'foot doctor' makes Peggy an Internet star on a foot fetish website."
    },

    {
      "number": 24,
      "title": "Peggy's Fan Fair",
      "description": "While attending a Nashville music festival with Hank and the guys, Peggy claims that Randy Travis stole lyrics from a song she wrote years ago."
    }
  ],
  "5": [
    {
      "number": 1,
      "title": "The Perils of Polling",
      "description": "When Hank takes Luanne to an election fair, Hank meets George W. Bush and shakes his hand, only to discover that Bush's handshake is weak, giving Hank doubts about voting for him. Meanwhile, Luanne becomes infatuated with Communist candidate Robert Parigi."
    },
    {
      "number": 2,
      "title": "The Buck Stops Here",
      "description": "Bobby becomes a golf caddy for Buck Strickland, who takes him along for the ride on a gambling junket. Hank and Peggy are disturbed when Buck's habits rub off on Bobby. Brad Renfro guest stars."
    },
    {
      "number": 3,
      "title": "I Don't Want to Wait for Our Lives to Be Over, I Want to Know Right Now, Will It Be... Sorry. Do Do Doo Do Do, Do Do Doo Do Do, Do Do Doo Do Do, Doo...",
      "description": "With Bobby's 13th birthday approaching, Joseph comes back from summer vacation having grown six inches. Bobby is upset that everyone still treats him like a little kid, and Joseph is being driven crazy by the onset of puberty. Meanwhile, Hank tries to build coffins for himself and Peggy."
    },
    {
      "number": 4,
      "title": "Spin the Choice",
      "description": "Despite Hank's promise to let him carve the turkey this year, Bobby boycotts Thanksgiving after receiving history lessons from John Redcorn that expose the shameful history behind it. Meanwhile, Peggy creates a pointless new game called 'Spin the Choice' when everyone gets sick of playing Boggle with her every year."
    },
    {
      "number": 5,
      "title": "Peggy Makes the Big Leagues",
      "description": "Peggy substitute-teaches at Arlen High School, but arouses the enmity of nearly all (including Hank and her fellow teachers) when she gives the school's unacademic football star (guest voiced by Brendan Fraser) a failing grade."
    },
    {
      "number": 6,
      "title": "When Cotton Comes Marching Home",
      "description": "Cotton moves to the VFW, and wants to march in the Veterans Day parade, but his boss denies him the time off from his degrading restroom attendant job."
    },
    {
      "number": 7,
      "title": "What Makes Bobby Run?",
      "description": "When Bobby becomes the school mascot, the 'Landry Longhorn,' he is deemed a coward after he runs away from a traditional half-time beating by the opposing team's band."
    },
    {
      "number": 8,
      "title": "Twas the Nut Before Christmas",
      "description": "In the third Christmas episode, Bill's holiday loneliness leads to him opening a 'Christmas village' in his yard, but things get out of hand when he takes on a twenty-something petty criminal (voiced by Ryan Phillippe) as a surrogate son."
    },
    {
      "number": 9,
      "title": 	"Chasing Bobby",
      "description": "When Hank becomes unusually emotional, especially while seeing a chick flick, Peggy believes it is because of a father-son void in his life, but Hank reveals that it is because of his truck, which is clearly on its last hinges."
    },
    {
      "number": 10,
      "title": "Yankee Hankee",
      "description": "Hank's application for a 'native Texan' license plate leads him to the utterly shocking news that he was born in a women's bathroom at Yankee Stadium in New York City, while Cotton and his cronies hatched a hare-brained scheme to assassinate Cuban dictator Fidel Castro."
    },
    {
      "number": 11,
      "title": 	"Hank and the Great Glass Elevator",
      "description": "On a daytrip to Austin for Bill's 40th birthday, Hank moons the former Governor of Texas, Ann Richards, leading Bill to take the blame and eventually enter a relationship with her. Bill's time with her leads to a fateful encounter with the last person he would ever expect to see again: his ex-wife, Lenore. Meanwhile, Peggy and Bobby try hamburgers grilled on a charcoal-powered barbecue for the first time—and run afoul of Hank's none-too-subtle loyalties when he discovers their stockpile of charcoal briquettes upon returning."
    },
    {
      "number": 12,
      "title": "Now Who's the Dummy?",
      "description": "Bobby acquires a ventriloquist's dummy named Chip Block, which dredges up childhood anxieties for Dale. Meanwhile, Hank becomes overly attached to Chip due to the dummy's 'knowledge' of sports."
    },
    {
      "number": 13,
      "title": "Ho Yeah!",
      "description": "Tammi (guest voiced by Renée Zellweger), a prostitute from The OKC hires on at Strickland Propane, moves in with the Hills, and encourages Peggy to add spice to her own life, but things heat up when Tammi's ex-pimp Alabaster Jones (guest voiced by Snoop Dogg) comes to Arlen and mistakes Hank for a pimp trying to steal Tammi away from him."
    },
    {
      "number": 14,
      "title": "The Exterminator",
      "description": "Dale goes from exterminating bugs to killing careers after a doctor tells Dale that the pesticides he's working with are taking a toll on his body and will kill him before he reaches 50 and Dale is forced to work an office job. Guest stars Lisa Kudrow as Amy Pittman."
    },
    {
      "number": 15,
      "title": "Luanne Virgin 2.0",
      "description": "When Luanne reveals to Hank that she is no longer a virgin (after her latest boyfriend breaks up with her), Hank puts Luanne in the church's 'born-again virgin' program, where Luanne meets a sexually insecure man (guest-voiced by Owen Wilson) and Peggy confesses that she had sex with a man (who turned out to be a homosexual) before she met Hank."
    },
    {
      "number": 16,
      "title": "Hank's Choice",
      "description": "When it turns out that Bobby is allergic to Ladybird, he ends up living in Ladybird's luxurious new doghouse while Ladybird continues living in the house, which makes the Hills a laughingstock with the neighbors."
    },
    {
      "number": 17,
      "title": 	"It's Not Easy Being Green",
      "description": "Bobby gets into helping the environment, which threatens to reveal a 30-year-old secret kept by Hank, Dale, and Bill. Guest stars Paul Giamatti as Mr. McKay."
    },
    {
      "number": 18,
      "title": "The Trouble with Gribbles",
      "description": "Nancy fears losing her job after the network considers hiring Luanne because she's younger and prettier. When Nancy decides to get plastic surgery to keep her job, Dale decides to sue his favorite tobacco company (Manitoba Cigarettes) so he can win money for the operation, but Nancy mistakes Dale trying to get evidence that Manitoba Cigarettes caused Nancy to lose her looks as a sign that Dale feels the same way about her as the network executives."
    },
    {
      "number": 19,
      "title": 	"Hank's Back Story",
      "description": "Hank is diagnosed with 'diminished gluteal syndrome' (a condition in which the butt shrinks in size and puts pressure on the spine) and is faced with choosing his health over his dignity when the doctor prescribes him a prosthetic posterior to wear."
    },
    {
      "number": 20,
      "title": "Kidney Boy and Hamster Girl: A Love Story",
      "description": "Bobby pretends to be a high school student with a kidney disorder that stunted his growth, and helps the student body win a radio station contest, with ska band No Doubt performing at the high school prom as the prize. Meanwhile, Dale gets a port-a-potty for the alley so no one will have to go into the house to use the bathroom."
    }
  ],
  "6": [
    {
      "number": 1,
      "title": 	"Bobby Goes Nuts",
      "description": "After getting attacked at a slumber party by Chane Wassonasong, Hank lets Bobby sign up for a boxing class at the YMCA, but Bobby ends up taking a women's self-defense course, where Bobby is taught to attack his aggressors by kicking them in the groin—including his own father, after Hank tries to teach Bobby the proper way to fight."
    },
     {
      "number": 2,
      "title": 	"Soldier of Misfortune",
      "description": "Dale is running for re-election as the Arlen Gun Club president, but his chances seem to be shot when he accidentally discharges his gun. To give Dale his confidence back, Hank pretends to be 'Mr. Big,' answers Dale's ad in Soldier of Fortune magazine, and assigns Dale to pick up a briefcase. But Dale bungles the job, and nearly gets his friends killed by his opponent at the Gun Club. Gary Busey guest stars as Mad Dog."
    },
     {
      "number": 3,
      "title": 	"Lupe's Revenge",
      "description": "Peggy takes the school Spanish club on a field trip to Mexico, and ends up in trouble for kidnapping a Mexican girl named Lupe, thanks to Peggy's horrible comprehension of the Spanish language. Meanwhile, Hank finds himself the object of the affections of a female police officer (voice of Kathy Bates), who keeps pulling him over for various reasons in order to spend time with him."
    },
     {
      "number": 4,
      "title": 	"The Father, the Son, and J.C.",
      "description": "While building a Habitat for Humanity house with former U.S. President Jimmy Carter, Buck promotes Hank to manager of Strickland Propane and Hank gushes with emotion to Buck, which doesn't sit well with Hank's father, Cotton."
    },
     {
      "number": 5,
      "title": 	"Father of the Bribe",
      "description": "Kahn tries to bribe Bobby to break up with Connie. Connie and Bobby decide to pretend to break up so they can get the money. When a schoolteacher thinks Connie may be depressed after Connie writes a note that reads 'I'm so bored, I could kill myself' (which was a response to a dull lecture), her parents try to push her and Bobby back together. After endless double dates with the parents, they become tired of each other, and decide to break up, to Kahn's horror. Meanwhile, Dale hosts a pirated radio show."
    },
     {
      "number": 6,
      "title": 	"I'm with Cupid",
      "description": "Following the events from the previous episode, Bobby seems fine in regards to his breakup with Connie and the upcoming Valentine's Day. However, when he is left home alone while Peggy and Hank go out, Bill depresses Bobby by suggesting that Bobby blew his only shot at true love."
    },
     {
      "number": 7,
      "title": 	"Torch Song Hillogy",
      "description": "Peggy nominates Bobby to carry the 2002 Winter Olympic Torch through Arlen, but Hank wins the honor—and bungles it."
    },
     {
      "number": 8,
      "title": 	"Joust Like a Woman",
      "description": "Peggy works as a cleaning wench at a Renaissance Faire, where her boss (Alan Rickman) refuses to give his female workers equal pay and benefits."
    },
     {
      "number": 9,
      "title": 	"The Bluegrass Is Always Greener",
      "description": "Connie and the guys form a bluegrass band and head to Branson, Missouri, against Kahn's wishes. Vince Gill provides Boomhauer's singing voice, and Charlie Daniels and Yakov Smirnoff make guest appearances as themselves."
    },
     {
      "number": 10,
      "title": 	"The Substitute Spanish Prisoner",
      "description": "After handing back tests to her class, Peggy is dumbfounded when Dooley asks her to explain the answer to a question. To restore her self-confidence, Peggy takes an Internet IQ test and discovers that she qualifies for 'genius' status, but discovers that the IQ test is a scam when she blows Hank's retirement fund on a diploma. She then plans a risky counter-con against the scam's organizer (voice of Jeff Goldblum) to get everyone's money back."
    },
     {
      "number": 11,
      "title": 	"Unfortunate Son",
      "description": "Cotton's VFW is in dire straits as members are dying and the veterans are behind on their propane bill, so the VFW moves to Hank's house, but the inclusion of Vietnam War veterans angers Cotton and the WWII vets and leads to an increasingly dangerous situation."
    },
     {
      "number": 12,
      "title": 	"Are You There God? It's Me, Margaret Hill",
      "description": "Peggy (who is Methodist) must pretend she is a nun after she gets a job at a Catholic school, but fears that lying about her religion will cost her her immortal soul."
    },
     {
      "number": 13,
      "title": 	"Tankin' It to the Streets",
      "description": "After Bill finds out the Army subjected him to a secret medical experiment called 'Operation Infinite Walrus' that left him fat and balding, he gets drunk and steals a tank, leaving his friends to try to save him from life in prison. Meanwhile, Peggy and Bobby try to win a free ice cream sundae from the Mega Lo-Mart's 'Guess Your Sundae's Weight' contest."
    },
     {
      "number": 14,
      "title": 	"Of Mice and Little Green Men",
      "description": "When Hank and Dale find they have more in common with each other's sons than their own, Dale finally concludes that Joseph is not his biological son -- and jumps to the wild conclusion that Joseph's biological father is an extraterrestrial who impregnated Nancy while he was gone."
    },
     {
      "number": 15,
      "title": 	"A Man Without a Country Club",
      "description": "Hank is asked to join the exclusive all-Asian Nine Rivers Country Club, which doesn't sit well with Kahn (who's been on the waiting list for the country club for the longest time) and doesn't sit well with Hank (who discovers that he's only been chosen because Nine Rivers needs a white man to show the PGA members that they're racially diverse)."
    },
     {
      "number": 16,
      "title": 	"Beer and Loathing",
      "description": "Peggy gets a job with Alamo beer, and learns that the company is knowingly selling tainted beer. Megan Mullally guest stars as Teresa."
    },
     {
      "number": 17,
      "title": 	"Fun with Jane and Jane",
      "description": "Luanne and Peggy unwittingly join a cult disguised as a college sorority. Meanwhile, Hank and his buddies try to find a place to hide Buck Strickland's emus after being ordered to kill them."
    },
     {
      "number": 18,
      "title": 	"My Own Private Rodeo",
      "description": "Dale and Nancy renew their wedding vows, and Nancy invites Dale's father, a gay man whom Dale detests for supposedly trying to win Nancy's affections away from him, to the ceremony."
    },
     {
      "number": 19,
      "title": 	"Sug Night",
      "description": "Hank freaks out when he begins having allegedly erotic dreams about grilling hamburgers naked with Dale's wife, Nancy."
    },
     {
      "number": 20,
      "title": 	"Dang Ol' Love",
      "description": "Boomhauer falls in love with a woman who wanted only a one-night stand (voice of Laura Linney), which crushes Boomhauer now that he feels like the many women he has seduced in the past, while Bill recovers from losing that same woman and finds advice that helps his friend."
    },
     {
      "number": 21,
      "title": 	"Returning Japanese",
      "description": "Cotton wants to return to Japan to apologize to the widow of a soldier he killed, and Peggy arranges to bring the family along. Hank is shocked to discover that Cotton actually had an affair with the widow and fathered another son—Junichiro. When Junichiro renounces his Hill ancestry, Cotton declares his own personal war on Japan by deciding to spit in the Japanese emperor's face."
    }
  ]
}
