 {
  "1": [
    {
      "number": 1,
      "title": "Pilot",
      "description": "Straitlaced propane salesman and family man, Hank Hill, is accused of beating his son, Bobby, after Bobby gets a black eye from getting hit in the face with a baseball during a Little League game and rumors spread that Hank beat up a teenaged Megalo-Mart employee (when really he just yelled at him for not knowing if the store sells a tap and dye and some WD-40). Meanwhile, Hank's friends, cuckolded conspiracy nut Dale Gribble, down-and-out Army barber Bill Dauterive, and fast-talking womanizer Jeff Boomhauer, try to fix Hank's truck, while Luanne Platter (Hank's niece) moves in with the Hills after her trailer trash parents get sent to jail over a domestic disturbance."
    },
    {
      "number": 2,
      "title": "Square Peg",
      "description": "Peggy is mortified and tongue-tied when she finds out she has been chosen to teach the middle school's sexual education class, while Hank does everything he can to keep his son from learning about sex."
    },
    {
      "number": 3,
      "title": "The Order of the Straight Arrow",
      "description": "Hank, Bill, Dale, and Boomhauer take Bobby and his friends on an Order of the Straight Arrow camping trip where the men send the boys on a snipe hunt during which Bobby stuns a whooping crane but then everyone believes it is dead. Meanwhile, Peggy sneaks out to buy special shoes for her large feet."
    },
    {
      "number": 4,
      "title": "Hank's Got the Willies",
      "description": "Hank is worried that Bobby does not have a normal role model in his life—and things get worse when Bobby accidentally hits Hank's idol, Willie Nelson (voiced by Nelson himself) with a golf club during a day on the green."
    },
    {
      "number": 5,
      "title": "Luanne's Saga",
      "description": "When Buckley breaks up with Luanne and Luanne goes on a days-long crying jag, Hank sets out to find Luanne a new boyfriend in 48 hours—which backfires when Hank sees Luanne with Boomhauer. Chuck Mangione also guest stars."
    },
    {
      "number": 6,
      "title": "Hank's Unmentionable Problem",
      "description": "Hank's ongoing constipation causes great concern for Peggy and, much to Hank's embarrassment, everyone else in Arlen."
    },
    {
      "number": 7,
      "title": "Westie Side Story",
      "description": "When a new Laotian family moves in next door, problems ensue when the new neighbor's family dog goes missing and the Hills fear that the stereotype about Asians eating dogs is true."
    },
    {
      "number": 8,
      "title": "Shins of the Father",
      "description": "Hank's brash, sexist father, Cotton Hill, crashes Bobby's 12th birthday party—and stays over the Hills' house, which does not sit well with Peggy when Cotton's misogyny begins rubbing off on Bobby."
    },
    {
      "number": 9,
      "title": "Peggy the Boggle Champ",
      "description": "Hank's promise to coach Peggy at the Texas State Boggle Championship is jeopardized when his buddies try to lure him away to the Ninth Annual Dallas Mower Expo. Meanwhile, Bobby and Luanne freak out when they leave a condensation ring on the new coffee table, but their efforts to fix it cause even more trouble."
    },
    {
      "number": 10,
      "title": "Keeping Up with Our Joneses",
      "description": "When Hank catches Bobby smoking a cigarette in a gas station bathroom, Hank punishes him by making his son smoke an entire carton, but the plan backfires when Bobby, Hank, and Peggy all become addicted."
    },
    {
      "number": 11,
      "title": "King of the Ant Hill",
      "description": "After telling Dale never to spray insecticide on his lawn again, Hank's expensive new lawn becomes mysteriously infested with fire ants days before Rainey Street's Cinco de Mayo celebration. Meanwhile, Bobby becomes the hypnotized servant for the Red Ant Queen."
    },
    {
      "number": 12,
      "title": "Plastic White Female",
      "description": "Bobby is invited to his first boy/girl party, and Peggy is horrified when she discovers him playing Spin the Bottle with one of Luanne's plastic beauty school heads."
    }
  ],
  "2": [
    {
      "number": 1,
      "title": "How to Fire a Rifle Without Really Trying",
      "description": "When Bobby displays a talent for target shooting, Hank signs up for a father–son fun shoot competition—only to discover a buried childhood memory is still sadly affecting his aim."
    },
    {
      "number": 2,
      "title": "Texas City Twister",
      "description": "Hank must save Peggy and Luanne from a tornado after he regrets not showing remorse for throwing Luanne out of the house and moving her back to the trailer that she moved out of after her mother tried to kill her father."
    },
    {
      "number": 3,
      "title": "The Arrow Head",
      "description": "Peggy's excitement over finding Indian artifacts in the front yard distresses Hank when a condescending university professor tricks Peggy into letting him dig in the Hills' yard."
    },
    {
      "number": 4,
      "title": "Hilloween",
      "description": "Hank goes to war with a litigious Evangelical Christian woman (voice of Sally Field) bent on banning Halloween and indoctrinating the kids by inviting them to a hell house."
    },
    {
      "number": 5,
      "title": "Jumpin' Crack Bass (It's a Gas, Gas, Gas)",
      "description": "Hank finds himself facing possible jail time after mistakenly buying crack cocaine to use as fish bait and the only way out is to prove that crack cocaine can be useful as fish bait."
    },
    {
      "number": 6,
      "title": "Husky Bobby",
      "description": "Hank is determined to save his son from humiliation after Bobby decides to model for a husky boy clothing line."
    },
    {
      "number": 7,
      "title": "The Man Who Shot Cane Skretteberg",
      "description": "Hank, Boomhauer, Bill and Dale face off in a paintball war against the teenage members of a garage band (guest-voiced by the members of the pop-punk band Green Day)."
    },
    {
      "number": 8,
      "title": "The Son That Got Away",
      "description": "Bobby, Connie and Joseph run away to The Caves, where half of Arlen's unplanned pregnancies begin, after each of them gets in trouble at school for disrupting class."
    },
    {
      "number": 9,
      "title": "The Company Man",
      "description": "When a new housing development is in need of a propane supplier, Buck instructs Hank to show the owner, an obnoxious Northerner who acts like a Southerner, a good time. However, Hank is none too thrilled to learn that this will require him to act like a cowboy stereotype."
    },
    {
      "number": 10,
      "title": "Bobby Slam",
      "description": "Hank is delighted when Bobby announces he is joining the school wrestling team, but Peggy is mortified when she learns her son must first wrestle Connie in order to make the team."
    },
    {
      "number": 11,
      "title": "The Unbearable Blindness of Laying",
      "description": "In this first Christmas episode, Hank is psychologically shocked into blindness after accidentally catching a glimpse of his mother and her new Jewish boyfriend (voiced by Carl Reiner) having sex on Hank's kitchen table."
    },
    {
      "number": 12,
      "title": "Meet the Manger Babies",
      "description": "Hank faces a dilemma of Biblical proportions when Luanne asks him to portray God in a live TV broadcast of her Christian puppet show, which is scheduled to occur during Hank's beloved Super Bowl party."
    },
    {
      "number": 13,
      "title": "Snow Job",
      "description": "During a rare snowstorm in Texas, Buck Strickland has a heart attack and hires an incompetent worker to run his company while Hank is chosen to house-sit -- and Hank's world is shattered when he finds that Buck is only in the propane business for the cash and not the customer satisfaction."
    },
    {
      "number": 14,
      "title": "I Remember Mono",
      "description": "While updating files at Arlen High School, Peggy learns that Hank's two-week absence from classes during their high school days was due to mononucleosis, not a back injury, and is crushed that what was a romantic story of young love is now a lie."
    },
    {
      "number": 15,
      "title": "Three Days of the Kahndo",
      "description": "Kahn's misreading of an advertisement for a Mexican timeshare results in him, Hank, and Dale getting trapped in Mexico, while Luanne and Bobby try to hide some contraband beauty products."
    },
    {
      "number": 16,
      "title": "Traffic Jam",
      "description": "When Hank and Kahn collide with each other's cars, they are both forced to attend traffic school courses taught by a raunchy black comedian (voiced by Chris Rock), who begins mentoring Bobby in the art of stand-up -- and who begins mining material from racist websites."
    },
    {
      "number": 17,
      "title": "Hank's Dirty Laundry",
      "description": "While purchasing a new dryer, Hank discovers that his credit is bad, thanks to a video store clerk who accuses Hank of renting a pornographic video and never returning it."
    },
    {
      "number": 18,
      "title": "The Final Shinsult",
      "description": "After losing his driver's license, Cotton moves in with Dale and plots to steal Antonio López de Santa Anna's wooden leg from a museum to use as a bargaining chip with the DMV."
    },
    {
      "number": 19,
      "title": "Leanne's Saga",
      "description": "Luanne's alcoholic mother is released from prison and starts dating Bill, whom she begins to abuse."
    },
    {
      "number": 20,
      "title": "Junkie Business",
      "description": "Strickland Propane's new employee (whom Hank hired because he preferred a man over the qualified woman who applied) turns out to be a drug addict who uses a legal trick that frees him from responsibility on the job and from being fired. Meanwhile, Peggy fears that the woman Hank turned down for the job may be after Hank."
    },
    {
      "number": 21,
      "title": "Life in the Fast Lane, Bobby's Saga",
      "description": "Bobby gets a job as a concession boy at the Arlen race track, where he discovers that his boss is a mean man (voice of David Herman). Hank pays very little attention to Bobby's horror stories until he witnesses the mistreatment firsthand. Meanwhile, Boomhauer is given the chance to drive the pace car in an upcoming race."
    },
    {
      "number": 22,
      "title": "Peggy's Turtle Song",
      "description": "When Bobby is misdiagnosed with attention deficit disorder (after eating too much sugary cereal and disrupting class), Peggy quits her job as a substitute teacher and becomes a stay-at-home mom, but soon realizes that she needs a hobby for her newfound time and begins taking guitar lessons."
    },
    {
      "number": 23,
      "title": "Propane Boom",
      "description": "Part one of two. Strickland Propane experiences discontinuation from business after the wholesale of economical propane from Mega Lo Mart, rendering Hank unemployed and forcing him to collude in a plot to disrupt a publicity stunt."
    }
  ],
  "3": [
    {
      "number": 1,
      "title": "Death of a Propane Salesman",
      "description": "Conclusion. The aftermath of the propane explosion from part one leaves Hank suffering from post-traumatic stress disorder around propane, a now bald Luanne repressing her grief for Buckley (who was the only casualty in the propane explosion) by becoming a Sinéad O'Connor-esque activist while angry, and Bobby worried about death."
    },
    {
      "number": 2,
      "title": "And They Call It Bobby Love",
      "description": "Bobby falls in love with a 14-year-old classmate (guest-voiced by Sarah Michelle Gellar), but soon learns that love hurts when the girl confesses that she only wants a platonic friend. Meanwhile, Hank, Dale, Bill, and Boomhauer become attached to a couch that was thrown out in the Hills' yard."
    },
    {
      "number": 3,
      "title": "Peggy's Headache",
      "description": "Peggy gets hired to write for the Arlen Bystander, but the stress of a new career leads her to require treatment from John Redcorn—and she soon discovers that John Redcorn had an affair with Nancy and is Joseph's biological father."
    },
    {
      "number": 4,
      "title": "Pregnant Paws",
      "description": "While Hank is busy trying to breed Ladybird, Dale decides to add a little excitement to his life by enrolling in a four-hour bounty hunter training course."
    },
    {
      "number": 5,
      "title": "Next of Shin",
      "description": "After Hank learns his sperm count is low, his mood worsens when Cotton shows up, boasting that his new wife, Didi, is pregnant."
    },
    {
      "number": 6,
      "title": "Peggy's Pageant Fever",
      "description": "Peggy enters the Mrs. Heimlich County Beauty pageant in hopes of winning a truck, but quickly discovers that she is not fit to compete with the other contestants."
    },
    {
      "number": 7,
      "title": "Nine Pretty Darn Angry Men",
      "description": "While shopping at the mall on Black Friday, Hank, Dale, Bill, Kahn, and Boomhauer are invited to be part of a focus group for a new mower (with Cotton as an uninvited guest), Luanne goes ice skating to forget about Buckley, and Peggy falls asleep at a shoe repair shop after tearing her loafer. Guest stars Billy Bob Thornton."
    },
    {
      "number": 8,
      "title": "Good Hill Hunting",
      "description": "Hank takes Bobby hunting in order to initiate him into the mysteries of manhood. However, everything goes wrong when Hank discovers that it is too late for Bobby to get a hunting license."
    },
    {
      "number": 9,
      "title": "Pretty, Pretty Dresses",
      "description": "In this second Christmas episode, Bill becomes more depressed than usual as it's the anniversary of his wife leaving him. Hank, Dale, and Boomhauer decide to watch Bill in case he threatens to commit suicide, but when Hank yells at him for being a burden, Bill's depression turns into delusion when he begins dressing in drag and impersonating his estranged wife, Lenore."
    },
    {
      "number": 10,
      "title": "A Firefighting We Will Go",
      "description": "In a Rashomon-meets-The Three Stooges-style story, Hank, Dale, Bill, and Boomhauer tell their own versions of their day as firefighters after getting arrested for burning the firehouse to the ground. Meanwhile, Bobby helps Peggy with a pulled groin muscle."
    },
    {
      "number": 11,
      "title": "To Spank, with Love",
      "description": "Peggy gains a reputation as an abusive disciplinarian when she spanks Dooley for humiliating her during class."
    },
    {
      "number": 12,
      "title": "Three Coaches and a Bobby",
      "description": "Hank gets his hard-knocks former high-school football coach to take on guidance of Bobby's football team, but the plan falls apart when Bobby joins the soccer team headed by a politically correct coach (voiced by Will Ferrell)."
    },
    {
      "number": 13,
      "title": "De-Kahnstructing Henry",
      "description": "Hank accidentally gets Kahn fired after revealing one of Kahn's top-secret plans for his company."
    },
    {
      "number": 14,
      "title": "The Wedding of Bobby Hill",
      "description": "To teach Bobby and Luanne a lesson in playing pranks, Hank orders Bobby to marry Luanne after Bobby takes her birth control pills."
    },
    {
      "number": 15,
      "title": "Sleight of Hank",
      "description": "Peggy is chosen to be a magician's assistant, but angers Hank when she will not tell him the secret behind one of his tricks."
    },
    {
      "number": 16,
      "title": "Jon Vitti Presents: Return to La Grunta",
      "description": "Luanne gets a job as a drink girl at a resort called La Grunta, where the golfers sexually harass her. Meanwhile, Hank goes to La Grunta to swim with the dolphins—and gets molested by one of them, and is paid off with hotel merchandise to keep from reporting the incident."
    },
    {
      "number": 17,
      "title": "Escape from Party Island",
      "description": "Hank reluctantly drives his mother and her friends to Port Aransas to shop for glass miniatures, but things get even worse when Hank and the rude old women have to contend with MTV's raucous spring breakers in order to leave."
    },
    {
      "number": 18,
      "title": "Love Hurts...and So Does Art",
      "description": "An X-ray of Hank's colon from 'Hank's Unmentionable Problem' winds up as the main attraction in an art museum. Meanwhile, Bobby is diagnosed with gout after eating chicken livers at a recently opened 'New York' style deli."
    },
    {
      "number": 19,
      "title": "Hank's Cowboy Movie",
      "description": "Hurt by Bobby's negative views of his hometown, Hank tries to get the Dallas Cowboys to move their training camp from Wichita Falls to Arlen. However, his promotion video for Arlen is ruined by his wife's and his friends' incompetence."
    },
    {
      "number": 20,
      "title": "Dog Dale Afternoon",
      "description": "After Dale annoys his friends by gloating over his new mower, he goes insane when they steal it as part of a prank."
    },
    {
      "number": 21,
      "title": "Revenge of the Lutefisk",
      "description": "Bobby accidentally burns down his church after getting sick from eating lutefisk, but Cotton gets blamed for it due to his sexist attitude towards the church accepting a female pastor."
    },
    {
      "number": 22,
      "title": "Death and Texas",
      "description": "Peggy visits a convict who tricks her into thinking he's a former student who ended up in jail and uses her as a cocaine mule. Meanwhile, Dale tries to apply for a job as a prison executioner."
    },
    {
      "number": 23,
      "title": "Wings of the Dope",
      "description": "After seeing the trampoline Kahn bought from Buckley's estate fall into disrepair, Hank and the guys move it to Hank's lawn to fix it. Buckley's Angel appears on it and visits Luanne. He persuades her to do something better with her life than attend beauty school and earns his halo afterward."
    },
    {
      "number": 24,
      "title": "Take Me Out of the Ball Game",
      "description": "Hank is picked to coach the company's softball team, spurring friction between Peggy and Hank."
    },
    {
      "number": 25,
      "title": "As Old as the Hills...",
      "description": "Part one of two. Fearing that they may be getting too old to be 'cool', Hank and Peggy spend their anniversary sky-diving, which comes to an abrupt end when Peggy's parachute malfunctions and she crashes onto a field. Meanwhile, Bobby struggles with taking his pregnant step-grandmother Didi to the hospital when her water breaks."
    }
  ],
  "4": [
    {
      "number": 1,
      "title": "...Peggy Hill: The Decline and Fall",
      "description": "Conclusion. Peggy struggles to regain her strength following her skydiving accident. Meanwhile, Bobby delivers Cotton's son (whom Cotton names 'Good Hank') but gets overwhelmed when neither Cotton nor Didi embrace new parenthood."
    },
    {
      "number": 2,
      "title": "Cotton's Plot",
      "description": "Cotton takes over Peggy's physical therapy in exchange for help getting a burial plot in the Texas State Cemetery, but Peggy discovers a discrepancy about Cotton's service in the Army during World War II."
    },
    {
      "number": 3,
      "title": "Bills Are Made to Be Broken",
      "description": "Bill's high school football record is broken unfairly, and (largely at Hank's insistence) he tries to get back on the field to set things right."
    },
    {
      "number": 4,
      "title": "Little Horrors of Shop"	,
      "description": "Buck Strickland insists that Hank take two weeks off from Strickland Propane, and Hank begins teaching wood shop at Tom Landry Middle School, and becomes so popular that Peggy grows envious of him. However, Hank gets in trouble for violating the school's zero-tolerance policy on weapons when he asks his students to bring in tools from home."
    },
    {
      "number": 5,
      "title": "Aisle 8A",
      "description": "Kahn and Minh go to Hawaii for Kahn's job and asks Hank to take care of Connie, who's excited that she will be staying with Bobby, but becomes emotional and mean-spirited when she gets her first period, leaving an extremely uncomfortable Hank to both deal with the unstable Connie and have to explain 'the birds and the bees' to Bobby (who has no idea why Connie is so emotional)."
    },
    {
      "number": 6,
      "title": "A Beer Can Named Desire",
      "description": "Hank wins an Alamo Beer contest for a chance to win a million dollars by throwing a football through a one-foot hole in a giant Alamo Beer can, while Bill visits his eccentric Cajun relatives in Louisiana."
    },
    {
      "number": 7,
      "title": "The Hank's Giving Episode",
      "description": "The Hills plan to fly to Montana for Thanksgiving, but are stranded with their neighbors at the airport by a snowstorm."
    },
    {
      "number": 8,
      "title": "Not in My Back-hoe"	,
      "description": "Drew Carey guest stars as a man who befriends Hank Hill after the two discover that they are very much alike. Meanwhile, Bill and Dale steal Hank's backhoe and take it to a pet cemetery, with disastrous results."
    },
    {
      "number": 9,
      "title": "To Kill a Ladybird",
      "description": "Bobby befriends a wild raccoon, that may, or may not have infected Dale and Ladybird with rabies."
    },
    {
      "number": 10,
      "title": "Hillennium",
      "description": "As Christmas approaches, Hank gets irritated over everyone panicking about the supposed technological apocalypse that will purportedly happen on January 1, 2000, due to the Y2K computer date glitch—but soon finds himself trying to safeguard his family after a propane shortage."
    },
    {
      "number": 11,
      "title": "Old Glory",
      "description": "Peggy writes a school essay for Bobby, and they both catch fire for it by a vengeful English teacher who accuses them of plagiarism. Meanwhile, Bill buys an oversized flag from the Army that is very special to him, but causes problems to his neighbors."
    },
    {
      "number": 12,
      "title": "Rodeo Days",
      "description": "When the rodeo comes to Arlen, Bobby tries his hand at cattle roping; when he fails miserably, he takes his career in the other direction, choosing to become a rodeo clown, much to Hank and Peggy's dismay."
    },
    {
      "number": 13,
      "title": "Hanky Panky",
      "description": "Part one of two. Buck Strickland and his wife Miz Liz separate, and Buck dumps his secretary/mistress Debbie Grund (Reese Witherspoon) -- and Hank becomes an object of desire for Miz Liz while Debbie plots to murder Buck Strickland. Meanwhile, Peggy becomes the proprietor of Sugarfoot's Barbecue Restaurant and finds Debbie Grund's dead body in a Dumpster."
    },
    {
      "number": 14,
      "title": "High Anxiety",
      "description": "Conclusion. Peggy continues her experiment in running Sugarfoot's, while Hank inadvertently tries marijuana and becomes a person of interest in Debbie Grund's murder -- until a state trooper discovers the truth behind Debbie's death."
    },
    {
      "number": 15,
      "title": "Naked Ambition",
      "description": "After a day of swimming at the river, Bobby accidentally walks in on Luanne naked. When Joseph hears the story, his imagination runs wild and he wants to see her nude too—until Connie catches them peeping. Meanwhile, Boomhauer floats down a river and ends up in Houston, where he is committed to a mental hospital due to his unintelligible speech."
    },
    {
      "number": 16,
      "title": "Movin' on Up",
      "description": "Fed up with Hank's demands, Luanne moves out of the Hills' den—and into a house with a trio of even more aggravating college-aged deadbeats."
    },
    {
      "number": 17,
      "title": "Bill of Sales",
      "description": "Peggy reluctantly recruits Bill into a pyramid scheme and is pleasantly surprised by his superb sales abilities, but she's surprised when her for-once sincere praise for him leads to him being unable to sell anymore."
    },
    {
      "number": 18,
      "title": "Won't You Pimai Neighbor?",
      "description": "Bobby undergoes tests to find out if he is the reincarnation of the Buddhist Lama Sanglug, much to Hank's discomfort."
    },
    {
      "number": 19,
      "title": "Hank's Bad Hair Day",
      "description": "After Hank's barber is forced to retire on account of the scarcity of business, Hank gets a haircut on the Army base from Bill, and puts Bill out of the job after lodging a complaint to the government about a $900 bill for the tonsorial procedure."
    },
    {
      "number": 20,
      "title": "Meet the Propaniacs",
      "description": "While working for Hank during the summer at Strickland Propane (instead of going to an acting camp), Bobby, some Strickland co-workers, Dale, and Luanne form a sketch comedy troupe called The Propaniacs."
    },
    {
      "number": 21,
      "title": "Nancy's Boys",
      "description": "Nancy breaks off her adulterous affair with John Redcorn after going on a date with Dale and falling in love with him all over again."
    },
    {
      "number": 22,
      "title": "Flush with Power",
      "description": "Arlen's City Council forces Hank to install low-flow toilets against his wishes when a drought hits town. Hank's anger leads him to join the local zoning board, which he discovers is rife with corruption."
    },
    {
      "number": 23,
      "title": "Transnational Amusements Presents: Peggy's Magic Sex Feet",
      "description": "After admitting her real shoe size during a night of bowling and learning from a shoe salesman that she's a size 16-and-a-half and will hit a size 20 in a few years, Peggy feels ashamed of her big feet—until a self-proclaimed 'foot doctor' makes Peggy an Internet star on a foot fetish website."
    },

    {
      "number": 24,
      "title": "Peggy's Fan Fair",
      "description": "While attending a Nashville music festival with Hank and the guys, Peggy claims that Randy Travis stole lyrics from a song she wrote years ago."
    }
  ],
  "5": [
    {
      "number": 1,
      "title": "The Perils of Polling",
      "description": "When Hank takes Luanne to an election fair, Hank meets George W. Bush and shakes his hand, only to discover that Bush's handshake is weak, giving Hank doubts about voting for him. Meanwhile, Luanne becomes infatuated with Communist candidate Robert Parigi."
    },
    {
      "number": 2,
      "title": "The Buck Stops Here",
      "description": "Bobby becomes a golf caddy for Buck Strickland, who takes him along for the ride on a gambling junket. Hank and Peggy are disturbed when Buck's habits rub off on Bobby. Brad Renfro guest stars."
    },
    {
      "number": 3,
      "title": "I Don't Want to Wait for Our Lives to Be Over, I Want to Know Right Now, Will It Be... Sorry. Do Do Doo Do Do, Do Do Doo Do Do, Do Do Doo Do Do, Doo...",
      "description": "With Bobby's 13th birthday approaching, Joseph comes back from summer vacation having grown six inches. Bobby is upset that everyone still treats him like a little kid, and Joseph is being driven crazy by the onset of puberty. Meanwhile, Hank tries to build coffins for himself and Peggy."
    },
    {
      "number": 4,
      "title": "Spin the Choice",
      "description": "Despite Hank's promise to let him carve the turkey this year, Bobby boycotts Thanksgiving after receiving history lessons from John Redcorn that expose the shameful history behind it. Meanwhile, Peggy creates a pointless new game called 'Spin the Choice' when everyone gets sick of playing Boggle with her every year."
    },
    {
      "number": 5,
      "title": "Peggy Makes the Big Leagues",
      "description": "Peggy substitute-teaches at Arlen High School, but arouses the enmity of nearly all (including Hank and her fellow teachers) when she gives the school's unacademic football star (guest voiced by Brendan Fraser) a failing grade."
    },
    {
      "number": 6,
      "title": "When Cotton Comes Marching Home",
      "description": "Cotton moves to the VFW, and wants to march in the Veterans Day parade, but his boss denies him the time off from his degrading restroom attendant job."
    },
    {
      "number": 7,
      "title": "What Makes Bobby Run?",
      "description": "When Bobby becomes the school mascot, the 'Landry Longhorn,' he is deemed a coward after he runs away from a traditional half-time beating by the opposing team's band."
    },
    {
      "number": 8,
      "title": "Twas the Nut Before Christmas",
      "description": "In the third Christmas episode, Bill's holiday loneliness leads to him opening a 'Christmas village' in his yard, but things get out of hand when he takes on a twenty-something petty criminal (voiced by Ryan Phillippe) as a surrogate son."
    },
    {
      "number": 9,
      "title": 	"Chasing Bobby",
      "description": "When Hank becomes unusually emotional, especially while seeing a chick flick, Peggy believes it is because of a father-son void in his life, but Hank reveals that it is because of his truck, which is clearly on its last hinges."
    },
    {
      "number": 10,
      "title": "Yankee Hankee",
      "description": "Hank's application for a 'native Texan' license plate leads him to the utterly shocking news that he was born in a women's bathroom at Yankee Stadium in New York City, while Cotton and his cronies hatched a hare-brained scheme to assassinate Cuban dictator Fidel Castro."
    },
    {
      "number": 11,
      "title": 	"Hank and the Great Glass Elevator",
      "description": "On a daytrip to Austin for Bill's 40th birthday, Hank moons the former Governor of Texas, Ann Richards, leading Bill to take the blame and eventually enter a relationship with her. Bill's time with her leads to a fateful encounter with the last person he would ever expect to see again: his ex-wife, Lenore. Meanwhile, Peggy and Bobby try hamburgers grilled on a charcoal-powered barbecue for the first time—and run afoul of Hank's none-too-subtle loyalties when he discovers their stockpile of charcoal briquettes upon returning."
    },
    {
      "number": 12,
      "title": "Now Who's the Dummy?",
      "description": "Bobby acquires a ventriloquist's dummy named Chip Block, which dredges up childhood anxieties for Dale. Meanwhile, Hank becomes overly attached to Chip due to the dummy's 'knowledge' of sports."
    },
    {
      "number": 13,
      "title": "Ho Yeah!",
      "description": "Tammi (guest voiced by Renée Zellweger), a prostitute from The OKC hires on at Strickland Propane, moves in with the Hills, and encourages Peggy to add spice to her own life, but things heat up when Tammi's ex-pimp Alabaster Jones (guest voiced by Snoop Dogg) comes to Arlen and mistakes Hank for a pimp trying to steal Tammi away from him."
    },
    {
      "number": 14,
      "title": "The Exterminator",
      "description": "Dale goes from exterminating bugs to killing careers after a doctor tells Dale that the pesticides he's working with are taking a toll on his body and will kill him before he reaches 50 and Dale is forced to work an office job. Guest stars Lisa Kudrow as Amy Pittman."
    },
    {
      "number": 15,
      "title": "Luanne Virgin 2.0",
      "description": "When Luanne reveals to Hank that she is no longer a virgin (after her latest boyfriend breaks up with her), Hank puts Luanne in the church's 'born-again virgin' program, where Luanne meets a sexually insecure man (guest-voiced by Owen Wilson) and Peggy confesses that she had sex with a man (who turned out to be a homosexual) before she met Hank."
    },
    {
      "number": 16,
      "title": "Hank's Choice",
      "description": "When it turns out that Bobby is allergic to Ladybird, he ends up living in Ladybird's luxurious new doghouse while Ladybird continues living in the house, which makes the Hills a laughingstock with the neighbors."
    },
    {
      "number": 17,
      "title": 	"It's Not Easy Being Green",
      "description": "Bobby gets into helping the environment, which threatens to reveal a 30-year-old secret kept by Hank, Dale, and Bill. Guest stars Paul Giamatti as Mr. McKay."
    },
    {
      "number": 18,
      "title": "The Trouble with Gribbles",
      "description": "Nancy fears losing her job after the network considers hiring Luanne because she's younger and prettier. When Nancy decides to get plastic surgery to keep her job, Dale decides to sue his favorite tobacco company (Manitoba Cigarettes) so he can win money for the operation, but Nancy mistakes Dale trying to get evidence that Manitoba Cigarettes caused Nancy to lose her looks as a sign that Dale feels the same way about her as the network executives."
    },
    {
      "number": 19,
      "title": 	"Hank's Back Story",
      "description": "Hank is diagnosed with 'diminished gluteal syndrome' (a condition in which the butt shrinks in size and puts pressure on the spine) and is faced with choosing his health over his dignity when the doctor prescribes him a prosthetic posterior to wear."
    },
    {
      "number": 20,
      "title": "Kidney Boy and Hamster Girl: A Love Story",
      "description": "Bobby pretends to be a high school student with a kidney disorder that stunted his growth, and helps the student body win a radio station contest, with ska band No Doubt performing at the high school prom as the prize. Meanwhile, Dale gets a port-a-potty for the alley so no one will have to go into the house to use the bathroom."
    }
  ],
  "6": [
    {
      "number": 1,
      "title": 	"Bobby Goes Nuts",
      "description": "After getting attacked at a slumber party by Chane Wassonasong, Hank lets Bobby sign up for a boxing class at the YMCA, but Bobby ends up taking a women's self-defense course, where Bobby is taught to attack his aggressors by kicking them in the groin—including his own father, after Hank tries to teach Bobby the proper way to fight."
    },
     {
      "number": 2,
      "title": 	"Soldier of Misfortune",
      "description": "Dale is running for re-election as the Arlen Gun Club president, but his chances seem to be shot when he accidentally discharges his gun. To give Dale his confidence back, Hank pretends to be 'Mr. Big,' answers Dale's ad in Soldier of Fortune magazine, and assigns Dale to pick up a briefcase. But Dale bungles the job, and nearly gets his friends killed by his opponent at the Gun Club. Gary Busey guest stars as Mad Dog."
    },
     {
      "number": 3,
      "title": 	"Lupe's Revenge",
      "description": "Peggy takes the school Spanish club on a field trip to Mexico, and ends up in trouble for kidnapping a Mexican girl named Lupe, thanks to Peggy's horrible comprehension of the Spanish language. Meanwhile, Hank finds himself the object of the affections of a female police officer (voice of Kathy Bates), who keeps pulling him over for various reasons in order to spend time with him."
    },
     {
      "number": 4,
      "title": 	"The Father, the Son, and J.C.",
      "description": "While building a Habitat for Humanity house with former U.S. President Jimmy Carter, Buck promotes Hank to manager of Strickland Propane and Hank gushes with emotion to Buck, which doesn't sit well with Hank's father, Cotton."
    },
     {
      "number": 5,
      "title": 	"Father of the Bribe",
      "description": "Kahn tries to bribe Bobby to break up with Connie. Connie and Bobby decide to pretend to break up so they can get the money. When a schoolteacher thinks Connie may be depressed after Connie writes a note that reads 'I'm so bored, I could kill myself' (which was a response to a dull lecture), her parents try to push her and Bobby back together. After endless double dates with the parents, they become tired of each other, and decide to break up, to Kahn's horror. Meanwhile, Dale hosts a pirated radio show."
    },
     {
      "number": 6,
      "title": 	"I'm with Cupid",
      "description": "Following the events from the previous episode, Bobby seems fine in regards to his breakup with Connie and the upcoming Valentine's Day. However, when he is left home alone while Peggy and Hank go out, Bill depresses Bobby by suggesting that Bobby blew his only shot at true love."
    },
     {
      "number": 7,
      "title": 	"Torch Song Hillogy",
      "description": "Peggy nominates Bobby to carry the 2002 Winter Olympic Torch through Arlen, but Hank wins the honor—and bungles it."
    },
     {
      "number": 8,
      "title": 	"Joust Like a Woman",
      "description": "Peggy works as a cleaning wench at a Renaissance Faire, where her boss (Alan Rickman) refuses to give his female workers equal pay and benefits."
    },
     {
      "number": 9,
      "title": 	"The Bluegrass Is Always Greener",
      "description": "Connie and the guys form a bluegrass band and head to Branson, Missouri, against Kahn's wishes. Vince Gill provides Boomhauer's singing voice, and Charlie Daniels and Yakov Smirnoff make guest appearances as themselves."
    },
     {
      "number": 10,
      "title": 	"The Substitute Spanish Prisoner",
      "description": "After handing back tests to her class, Peggy is dumbfounded when Dooley asks her to explain the answer to a question. To restore her self-confidence, Peggy takes an Internet IQ test and discovers that she qualifies for 'genius' status, but discovers that the IQ test is a scam when she blows Hank's retirement fund on a diploma. She then plans a risky counter-con against the scam's organizer (voice of Jeff Goldblum) to get everyone's money back."
    },
     {
      "number": 11,
      "title": 	"Unfortunate Son",
      "description": "Cotton's VFW is in dire straits as members are dying and the veterans are behind on their propane bill, so the VFW moves to Hank's house, but the inclusion of Vietnam War veterans angers Cotton and the WWII vets and leads to an increasingly dangerous situation."
    },
     {
      "number": 12,
      "title": 	"Are You There God? It's Me, Margaret Hill",
      "description": "Peggy (who is Methodist) must pretend she is a nun after she gets a job at a Catholic school, but fears that lying about her religion will cost her her immortal soul."
    },
     {
      "number": 13,
      "title": 	"Tankin' It to the Streets",
      "description": "After Bill finds out the Army subjected him to a secret medical experiment called 'Operation Infinite Walrus' that left him fat and balding, he gets drunk and steals a tank, leaving his friends to try to save him from life in prison. Meanwhile, Peggy and Bobby try to win a free ice cream sundae from the Mega Lo-Mart's 'Guess Your Sundae's Weight' contest."
    },
     {
      "number": 14,
      "title": 	"Of Mice and Little Green Men",
      "description": "When Hank and Dale find they have more in common with each other's sons than their own, Dale finally concludes that Joseph is not his biological son -- and jumps to the wild conclusion that Joseph's biological father is an extraterrestrial who impregnated Nancy while he was gone."
    },
     {
      "number": 15,
      "title": 	"A Man Without a Country Club",
      "description": "Hank is asked to join the exclusive all-Asian Nine Rivers Country Club, which doesn't sit well with Kahn (who's been on the waiting list for the country club for the longest time) and doesn't sit well with Hank (who discovers that he's only been chosen because Nine Rivers needs a white man to show the PGA members that they're racially diverse)."
    },
     {
      "number": 16,
      "title": 	"Beer and Loathing",
      "description": "Peggy gets a job with Alamo beer, and learns that the company is knowingly selling tainted beer. Megan Mullally guest stars as Teresa."
    },
     {
      "number": 17,
      "title": 	"Fun with Jane and Jane",
      "description": "Luanne and Peggy unwittingly join a cult disguised as a college sorority. Meanwhile, Hank and his buddies try to find a place to hide Buck Strickland's emus after being ordered to kill them."
    },
     {
      "number": 18,
      "title": 	"My Own Private Rodeo",
      "description": "Dale and Nancy renew their wedding vows, and Nancy invites Dale's father, a gay man whom Dale detests for supposedly trying to win Nancy's affections away from him, to the ceremony."
    },
     {
      "number": 19,
      "title": 	"Sug Night",
      "description": "Hank freaks out when he begins having allegedly erotic dreams about grilling hamburgers naked with Dale's wife, Nancy."
    },
     {
      "number": 20,
      "title": 	"Dang Ol' Love",
      "description": "Boomhauer falls in love with a woman who wanted only a one-night stand (voice of Laura Linney), which crushes Boomhauer now that he feels like the many women he has seduced in the past, while Bill recovers from losing that same woman and finds advice that helps his friend."
    },
     {
      "number": 21,
      "title": 	"Returning Japanese",
      "description": "Cotton wants to return to Japan to apologize to the widow of a soldier he killed, and Peggy arranges to bring the family along. Hank is shocked to discover that Cotton actually had an affair with the widow and fathered another son—Junichiro. When Junichiro renounces his Hill ancestry, Cotton declares his own personal war on Japan by deciding to spit in the Japanese emperor's face."
    }
  ],
  "7": [
    {
      "number": 1,
      "title": 	"Get Your Freak Off",
      "description": "Hank takes Bobby and his friends to a music concert, but is dismayed to see Bobby and a friend dancing inappropriately to boy band music, so he tries to make Bobby's adolescence more wholesome. Meanwhile, Peggy, Nancy, and Minh try to decide who is the best-looking out of Hank, Dale, Boomhauer, Kahn, Bill, and John Redcorn. Guest stars Eliza Dushku, Milla Jovovich, Debra Messing, and Elizabeth Perkins."
    },
    {
      "number": 2,
      "title": 	"The Fat and the Furious",
      "description": "Bill becomes a competitive eater after downing Hank's entire platter of hot dogs during a barbecue, but his dreams are soon crushed when Dale (who thinks competitive eating is degrading) beats him. Guest stars include Pamela Anderson, Jeff Garlin, and Kid Rock."
    },
    {
      "number": 3,
      "title": 	"Bad Girls, Bad Girls, Whatcha Gonna Do",
      "description": "Connie's criminal cousin, Tid Pau (voiced by Lucy Liu), becomes Bobby's science project partner and makes him an unwitting accomplice in creating a drug lab."
    },
    {
      "number": 4,
      "title": 	"Goodbye Normal Jeans",
      "description": "Peggy becomes jealous of Bobby when he uses his Home Ec. class cooking skills in the Hill kitchen."
    },
    {
      "number": 5,
      "title": 	"Dances with Dogs",
      "description": "Bobby and Hank use Ladybird to compete in a dog dancing contest. Meanwhile, Bill is tricked into buying an ill-tempered Rottweiler from an animal shelter. Scott Hamilton guest stars."
    },
    {
      "number": 6,
      "title": 	"The Son Also Roses",
      "description": "Bobby becomes a rose grower when he tires of doing the Landry football team's laundry, and recruits the help of two cannabis cultivators to help him win a contest. Michael Clarke Duncan guest stars as Morgan, a rose growing enthusiast."
    },
    {
      "number": 7,
      "title": 	"The Texas Skillsaw Massacre",
      "description": "The Hills are forced to live with the Gribbles after Dale digs a tunnel underneath the Hills' kitchen, and the inspector declares the Hill house uninhabitable until the necessary repairs are done. Things get worse when Hank is sentenced to take anger management classes after accidentally cutting one of Dale's fingers off with a circular saw."
    },
    {
      "number": 8,
      "title": 	"Full Metal Dust Jacket",
      "description": "Peggy takes over the lease of a bookstore, but when the bookstore's business plummets, she allows Dale and his gun group to sell firearms at the store. Peri Gilpin guest stars as Mary Ellen."
    },
    {
      "number": 9,
      "title": 	"Pigmalion",
      "description": "Luanne becomes involved with the psychotic owner (voiced by Michael Keaton) of a pork processing plant who wants Luanne to be just like the woman on the company logo."
    },
    {
      "number": 10,
      "title": 	"Megalo Dale",
      "description": "Dale is hired to exterminate at the Mega Lo Mart, but it turns out the 'pest' is Chuck Mangione, the Mega Lo Mart spokesman. Topher Grace and Danny Masterson make guest appearances."
    },
    {
      "number": 11,
      "title": 	"Boxing Luanne",
      "description": "To prove to men that she is more than just a pretty face and a sexy body, Luanne becomes a boxer, but soon learns that the boxing she has done was foxy boxing, and that every fight she won had been fixed and that she is soon to fight George Foreman's daughter, Freeda."
    },
    {
      "number": 12,
      "title": 	"Vision Quest",
      "description": "John Redcorn is worried about how Dale is raising Joseph, so he gets Hank to take Joseph on a 'vision quest', but Dale is the one who gets a vision and mistakenly believes that he is a Native American."
    },
    {
      "number": 13,
      "title": 	"Queasy Rider",
      "description": "Hank and Peggy try to fix their strained marriage by buying a motorcycle and immersing themselves in the biker lifestyle, only to find that the biker lifestyle is very misogynistic."
    },
    {
      "number": 14,
      "title": 	"Board Games",
      "description": "Peggy, Nancy, and Minh run for school board against each other after Tom Landry Middle School cuts all after-school programs out of the budget -- and all three women will stop at nothing to get the empty seat."
    },
    {
      "number": 15,
      "title": 	"An Officer and a Gentle Boy",
      "description": "Fed up with Bobby's laziness, Hank sends him off to Cotton's old military school Fort Berk Academy, but Cotton is dismayed that Fort Berk has softened up and sets out to make it as brutal as possible."
    },
    {
      "number": 16,
      "title": 	"The Miseducation of Bobby Hill",
      "description": "Bobby becomes a salesman at Strickland Propane (although Hank doubts his ability, citing his inexperience) and uses underhanded tactics learned from Joe Jack to sell more grills. Meanwhile, Dale builds a Larry Walters-inspired flying lawn chair and tests it out on Bill, who ends up battered, bruised, and lost in Mexico."
    },
    {
      "number": 17,
      "title": 	"The Good Buck",
      "description": "Buck becomes a born-again Christian (courtesy of Luanne) after his wife divorces him, but Hank is worried that Buck only wants Luanne for sex. Meanwhile, Bobby hides out from his track coach and makes friends with two old ladies at Hotel Arlen's restaurant during tea time."
    },
    {
      "number": 18,
      "title": 	"I Never Promised You an Organic Garden",
      "description": "Peggy takes over the organic garden at the school, but she is caught using pesticides on the garden when every organic treatment fails to save the garden from bug infestation."
    },
    {
      "number": 19,
      "title": 	"Be True to Your Fool",
      "description": "When Bill infects Hank, Dale, and Boomhauer with lice, they are forced to shave off their hair, only for Hank to discover the word 'Bill' tattooed on the back of his head. Meanwhile, Bill befriends prisoners at the county jail after being arrested for being drunk in public."
    },
    {
      "number": 20,
      "title": 	"Racist Dawg",
      "description": "Hank hires an African-American repairman (guest-voiced by Bernie Mac), whom Ladybird attacks, prompting the town to think that Hank and his dog are racists."
    },
    {
      "number": 21,
      "title": 	"Night and Deity",
      "description": "After Bill attracts pigeons to the alley, Dale must work with an attractive female exterminator (voice of Janeane Garofalo), who makes Nancy jealous."
    },
    {
      "number": 22,
      "title": 	"Maid in Arlen",
      "description": "Kahn's mother Laoma arrives and soon becomes the Hills' housekeeper, much to Kahn's annoyance. Bill and Laoma later enter into a romantic relationship that Kahn works overtime to sabotage."
    },
    {
      "number": 23,
      "title": 	"The Witches of East Arlen",
      "description": "After losing out on playing Curly in the school production of Oklahoma!, Bobby gets involved with a group of post-adolescent geeks who are into tarot cards and witchcraft. David Cross guest stars."
    }
  ],
  "8": [
    {
      "number": 1,
      "title": 	"Patch Boomhauer",
      "description": "When Boomhauer's brother (voiced by Brad Pitt) announces he is getting married to Boomhauer's old girlfriend, Hank believes Boomhauer is out to sabotage the wedding."
    },
    {
      "number": 2,
      "title": 	"Reborn to Be Wild"	,
      "description": "Fearing that Bobby is succumbing to bad influences, Hank makes him join a local church youth group. Bobby discovers that the group consists of cool punks (guest voiced by the band members of Sum 41[5]), including their tattooed pastor, i.e. 'Pastor K', who worship God through skateboarding and rock. Hank approves of Bobby's newfound interest in religion, but disapproves of the way the group treats Christianity as a fad. Meanwhile, Hank's friends (and Kahn) start a club called 'The Last Meal Club', where they come up with what meals they would like to eat before they die."
    },
    {
      "number": 3,
      "title": 	"New Cowboy on the Block",
      "description": "A washed-up former Dallas Cowboys player moves into the neighborhood, and no one, not even Hank, can admit that he is a jerk—until the man starts harassing Hank."
    },
    {
      "number": 4,
      "title": 	"The Incredible Hank",
      "description": "Hank takes Bobby to the doctor to get him some testosterone supplements to boost his energy, but Hank becomes the one who sorely needs a testosterone boost. Meanwhile, Bobby faces his fear of showering after gym class."
    },
    {
      "number": 5,
      "title": 	"Flirting with the Master",
      "description": "The actor who plays TV's 'Monsignor Martinez' invites Peggy to Mexico City to tutor his children for an English language exam, and Peggy thinks the actor has fallen in love with her. Meanwhile, Luanne takes on Peggy's duties at home."
    },
    {
      "number": 6,
      "title": 	"After the Mold Rush",
      "description": "When Hank's house sustains minor water damage days before the Arlen Parade of Homes, a man from the insurance company sets out to get rich by determining that the Hill household is infested with mold and shaking them down for money with needless tests and repairs."
    },
    {
      "number": 7,
      "title": 	"Livin' on Reds, Vitamin C and Propane",
      "description": "Hank needs to take some antique furniture to his mother in Arizona, so he rents an 18-wheeler and takes Bobby on a road trip (with Dale, Bill and Boomhauer stowing away). Meanwhile, Peggy and Luanne try to write a Christmas novelty song. Trace Adkins guest stars."
    },
    {
      "number": 8,
      "title": 	"Rich Hank, Poor Hank",
      "description": "Bobby thinks Hank is secretly a rich miser after hearing Peggy talking about Hank's new $1000 bonus, and Bobby steals Hank's emergency credit card to go on a shopping spree with Connie and Joseph."
    },
    {
      "number": 9,
      "title": 	"Ceci N'Est Pas Une King of the Hill",
      "description": "When Hank asks Peggy to design an art piece for Strickland Propane, she creates the 'Probot,' a statue made out of propane tanks. Her sculpture is rejected by the city board, but picked up by an art dealer from Dallas -- who makes her out to be an uneducated hillbilly. Meanwhile, Dale starts wearing a suit of armor and uses his newfound invincibility to insult people without consequence – until Bill creates his own suit of armor and challenges him to a fight."
    },
    {
      "number": 10,
      "title": 	"That's What She Said",
      "description": "A new employee named Rich (voiced by Ben Stiller) becomes popular around Strickland Propane for telling lewd jokes, but Hank feels uncomfortable about them and the lawyer he talks to advises Hank to sue for sexual harassment (since telling raunchy jokes during work hours counts as harassment). Meanwhile, Dale trades smoking cigarettes for chewing tobacco."
    },
    {
      "number": 11,
      "title": 	"My Hair Lady",
      "description": "Luanne and Bill both get jobs at the hippest hair salon in Arlen called 'Hottyz.' But in order to keep his job, Bill must pretend to be gay. Meanwhile, Hank's elderly barber has a hard time staying in business."
    },
    {
      "number": 12,
      "title": 	"Phish and Wild Life",
      "description": "Hank takes Bobby (who needs a lesson in self-reliance) and the guys on a fishing trip, where they vow to eat only what they catch, but the trip is ruined by hippies who would rather sponge off the park's resources, and Bobby inadvertently letting the hippies live off Hank."
    },
    {
      "number": 13,
      "title": 	"Cheer Factor",
      "description": "Peggy volunteers to help with the school cheerleading squad by having Bobby as a mascot and participating with the cheerleaders, but soon finds herself facing the school board after her 'Fighting Irish' show is deemed offensive."
    },
    {
      "number": 14,
      "title": 	"Dale Be Not Proud",
      "description": "When NHRA driver John Force needs an organ transplant, Dale is the only one who can save him. Hank encourages Dale to ignore his fear of hospitals and give up his kidney to save Force. Dale reluctantly agrees, but only if Hank takes his place being Dale for the day, a task that consists of outlandish duties."
    },
    {
      "number": 15,
      "title": 	"Après Hank, le Deluge",
      "description": "When a flood threatens the town, the Arlenites gather in the communal shelter: the Tom Landry gym. When Hank is forced to flood a number of houses, lest he risk the dam bursting and flooding the entire city, the crowd does not get the full story and turns on him, led by Bill, who uses the people's panic to make himself feel important. Meantime, the kids go wild in the yearbook office, Peggy begins acting childish, and Dale schemes to build an ark to float his family to safety."
    },
    {
      "number": 16,
      "title": 	"DaleTech",
      "description": "Dale starts a security company called 'DaleTech', but his business is threatened by Cotton, who has become a new local auxiliary police officer. Meanwhile, Hank tries to solve the mystery of who's been in his house while everyone else is out."
    },
    {
      "number": 17,
      "title": 	"How I Learned to Stop Worrying and Love the Alamo",
      "description": "Hank tries to teach Bobby about the Alamo after discovering that the new history textbooks in school contain pop history — and things get worse when Hank's plans for an Alamo play include a director who wants to portray the American force as a bunch of drunken, doped-up, slave-owning, prostitute-loving cowards. Meanwhile, Nancy gets a Flat Stanley doll in the mail, and Peggy and Luanne put it through dangerous scenarios to teach kids about safety."
    },
    {
      "number": 18,
      "title": 	"Girl, You'll Be a Giant Soon",
      "description": "Luanne tries to help Hank protest against a grilling contest when it is revealed that the contest does not allow propane grills. Meanwhile, Peggy tries to visit a house where a famous murder took place, but the real estate agent is only letting in potential buyers."
    },
    {
      "number": 19,
      "title": 	"Stressed for Success",
      "description": "Bobby joins the school's Quiz Bowl team because of his extensive knowledge of pop culture, but he becomes stressed out by the pressure. This episode is dedicated to John Ritter. Kelly Clarkson and Ben Stein also guest star."
    },
    {
      "number": 20,
      "title": 	"The Unbearable Lightness of Being Hank",
      "description": "When Hank suffers a back injury at work and none of his doctors can fix it, he tries the healing powers of yoga. At first, he finds it a little too wacky, but thanks to the help of Yogi Victor, he realizes that it actually works. However, Hank's insurance company uses this to prove that Hank is taking unfair advantage of his workers' compensation. Meanwhile, Peggy fights to keep the old Pink & White market open by returning to her old job as a bagger. Guest stars Angela Bloomfield, Johnny Depp as Yogi Victor, and Marg Helgenberger as the claims adjuster"
    },
    {
      "number": 21,
      "title": "The Redneck on Rainey Street",
      "description": "After Connie is turned down for a college prep summer program and realizing that their hard work and overachieving has gotten them nowhere in life, Kahn and Minh decide to give up and live like beer-drinking, El Camino-driving rednecks, which nearly drive them to homelessness when they stop making payments on their house. Trace Adkins, Elizabeth Perkins, and Tom Petty guest star."
    },
    {
      "number": 22,
      "title": "Talking Shop",
      "description": "Despite Hank's wishes for Bobby to take auto shop, Bobby takes peer counseling so he can give advice to vulnerable teenage girls. Meanwhile, Hank finds a wrecked car for Bobby to fix, thinking that he signed up for auto shop. Guest stars include Alyson Hannigan, Lindsay Lohan, and Laura Prepon."
    }
  ],
  "9": [
    {
      "number": 1,
      "title": "A Rover Runs Through It",
      "description": "The Hills travel to Montana to visit Peggy's mother for Thanksgiving. There, they find out the family is losing the ranch to Henry Winkler because of high property taxes."
    },
    {
      "number": 2,
      "title": "Ms. Wakefield",
      "description": "When an elderly stranger, Ms. Wakefield (voice of Marion Ross), visits the Hill residence during Christmas, Hank is thrilled to show her his house since it was also her childhood home. However, when Ms. Wakefield announces that she wants to die in their house, Hank and Peggy want nothing more than for her to leave, despite her bothersome insistence."
    },
    {
      "number": 3,
      "title": "Death Buys a Timeshare",
      "description": "Cotton inherits $10,000 from the will of his friend Topsy, and goes to Mexico, with Bill in tow, to buy a timeshare. Feeling lonely after the death of his friend, Cotton gets suckered in by tales of the timeshare development's owner, O'Kelly, and decides to buy—even though Americans cannot own land in Mexico. Meanwhile during a heatwave in Arlen, Peggy, Bobby and Dale search for a pool to swim in."
    },
    {
      "number": 4,
      "title": "Yard, She Blows!",
      "description": "Peggy is jealous that Hank always gets complimented on his yard, so she starts a garden in the front yard. When that plan fails, she puts Winklebottom the garden gnome in their front yard, which drives Hank insane."
    },
    {
      "number": 5,
      "title": "Dale to the Chief",
      "description": "When Dale reads Joseph the Warren Commission Report, he notices the absence of a discrepancy in the positioning of the local landmarks, decides that the U.S. government must be right about who assassinated John F. Kennedy (and thus, their official version of every story he had previously written off as part of some conspiracy is in fact completely factual) and turns his government-hating, right-wing mania into even more insufferable, flag-waving patriotism. Meanwhile, Hank discovers a mistake on his driver's license and is sent through a boatload of red tape in order to fix it—a task made all the more onerous when Dale reports Hank as a threat to America's national security."
    },
    {
      "number": 6,
      "title": "The Petriot Act",
      "description": "When Hank agrees to take in a soldier's pet, he gets Duke, a vicious, mean-spirited cat, against Hank's wishes. Hank takes Duke to visit Dr. Leslie (voice of Jason Bateman), a veterinarian who runs a battery of tests and presents Hank with a bill for several thousand dollars."
    },
    {
      "number": 7,
      "title": "Enrique-cilable Differences",
      "description": "Hank's co-worker Enrique is having marital problems, and starts spending all his time with Hank. Meanwhile, Bobby tries to unblock the Fox network from the Hills' TV in order to watch the Daytona 500."
    },
    {
      "number": 8,
      "title": "Mutual of Omabwah",
      "description": "When Hank forgets to mail his insurance payment, Hank and Bobby must protect themselves from any accidents until their insurance can be re-activated in 36 hours. Meanwhile, Dale decides to raise bees, Bill and Boomhauer discover the joys of deep-frying, and Peggy and Luanne get stuck at a rest stop when Hank asks them not to drive uninsured."
    },
    {
      "number": 9,
      "title": "Care-Takin' Care of Business",
      "description": "When the Tom Landry Middle School football team has to forfeit a game due to poor field maintenance when the caretaker goes senile, the booster club resolves to replace the school's elderly groundskeeper, Smitty (voice of Christopher Lloyd), and Hank resolves to help him keep his job by secretly doing upkeep on the field. Meanwhile, Luanne starts dating a redneck named Lucky (first seen in 'The Redneck on Rainey Street'), much to Peggy's dismay."
    },
    {
      "number": 10,
      "title": "Arlen City Bomber",
      "description": "To pay off her credit card debts, Luanne signs up to be a roller derby girl. Peggy gets in on it too and uses borrowed money to make improvements on the team, sinking both Luanne and Peggy deeper into debt."
    },
    {
      "number": 11,
      "title": "Redcorn Gambles with His Future",
      "description": "Hank is in charge of organizing the Strickland Family Fun Day. Meanwhile, John Redcorn and his band 'Big Mountain Fudgecake' are having trouble finding a venue to play their music. Acting on Hank's advice, John Redcorn uses his land to open a casino so his band can have a place to play."
    },
    {
      "number": 12,
      "title": "Smoking and the Bandit",
      "description": "When Arlen bans smoking in all restaurants and bars, Dale becomes the rebellious 'Smoking Bandit' to impress Joseph. Meanwhile, Peggy decides to tail the 'Bandit' and unmask him. Tone Lōc guest stars."
    },
    {
      "number": 13,
      "title": "Gone with the Windstorm",
      "description": "When Channel 84 hires a new meteorologist, Irv Bennett, Nancy and her less-than-accurate weather reports are left out in the cold -- and the only way back to being hot is for Nancy to cover news of a forest fire. Meanwhile, Bobby tries to fight back against a bully who springs out and scares his victims."
    },
    {
      "number": 14,
      "title": "Bobby on Track",
      "description": "Upset with Bobby's habit of giving up what he starts (after Bobby does not complete the miles needed to run for a charity race), Hank puts Bobby on the school's track team, but soon learns that the coach only wants Bobby as a 'Stick' so he can push the other team members to do better."
    },
    {
      "number": 15,
      "title": "It Ain't Over 'til the Fat Neighbor Sings",
      "description": "Bill joins an all-male chorus (based on a real Dallas-based men's chorus called The Vocal Majority) who end up using Bill and forcing him to blow off his appointment to cut the general's hair at the Army base. Meanwhile, Peggy and Bobby get caught up in a game of Pong after Peggy finds her old Atari console in the closet."
    }
  ],
  "10": [
     {
      "number": 1,
      "title": "Hank's on Board",
      "description": "Hank fears he is being shunned when his friends go on a vacation without him. Meanwhile, Bobby uses grocery money entrusted to him by Peggy to buy a metal detector."
    },
    {
      "number": 2,
      "title": 	"Bystand Me",
      "description": "When the Arlen Bystander newspaper gets a new editor, Peggy gets a job writing a household hints column (even though Peggy does not know any household hints). Meanwhile, Hank makes Bobby get a paper route."
    },
    {
      "number": 3,
      "title": "Bill's House",
      "description": "Bill turns his house into a rehabilitation center for alcoholics, and enlists Hank's assistance when the task gets out of hand."
    },
    {
      "number": 4,
      "title": "Harlottown",
      "description": "While researching for an article, Peggy discovers that Arlen's founding mothers were prostitutes, which embarrasses Hank and prompts the city manager to open a Museum of Prostitution and have Arlen be the new city for the Adult Video Awards."
    },
    {
      "number": 5,
      "title": 	"Portrait of the Artist as a Young Clown",
      "description": "Bobby goes to clown college and becomes a classical clown, but no one likes his new act except Bobby himself."
    },
    {
      "number": 6,
      "title": "Orange You Sad I Did Say Banana?",
      "description": "Upon being told that he is too Americanized and called a 'banana', Kahn vows to return to his Laotian roots, which doesn't sit well with Minh and Connie, who are used to living the fat, pop-culture obsessed American life. Meanwhile, Hank, Bill, Dale, and Boomhauer help Kahn build a pool in his backyard."
    },
    {
      "number": 7,
      "title": "You Gotta Believe (in Moderation)",
      "description": "Hank invites a softball team to compete against his own team of misfits, to raise money to save Tom Landry Middle School's baseball team."
    },
    {
      "number": 8,
      "title": "Business Is Picking Up",
      "description": "Hank tries to get Bobby interested in working as a propane salesman during Tom Landry Middle School's Career Day, but when Joseph beats him to the punch, Bobby shadows a young, handsome man (voice of Johnny Knoxville) who makes his living picking up animal (and human) waste."
    },
    {
      "number": 9,
      "title": "The Year of Washing Dangerously",
      "description": "Kahn buys the local car wash as part of get-rich-quick scheme he saw on TV, and Hank finds himself working for his disrespectful, money-obsessed neighbor when Buck takes a stake in the business as well."
    },
    {
      "number": 10,
      "title": "Hank Fixes Everything",
      "description": "Buck Strickland hires the Teutul family from the reality show American Chopper (who voice themselves) to perform at Strickland Propane in order to win a price war with Thatherton Fuels, then gets into a price fixing conspiracy with the other propane companies in Arlen which attracts the government's attention—centered on Hank."
    },
    {
      "number": 11,
      "title": 	"Church Hopping",
      "description": "When the Hill family finds out that their pew of many years has been given away to another family at church, they abandon their staid Methodist church and come about to worship at a new megachurch, but, while Bobby and Peggy enjoy it, Hank begins to miss his old church."
    },
    {
      "number": 12,
      "title": 	"24 Hour Propane People",
      "description": "When Buck gets banned from his favorite strip club, he focuses on making Strickland Propane a 'fun' place to work after spending his days at a Cold Stone Creamery-style ice cream parlor where the clerks sing to their customers and give out gimmicky sizes and prizes for their service."
    },
    {
      "number": 13,
      "title": "The Texas Panhandler",
      "description": "When Hank refuses to buy Bobby designer faded jeans, Bobby gets a job as a sign spinner -- but quits when he realizes that he can get more money by becoming a slacker who begs for money for fun."
    },
    {
      "number": 14,
      "title": 	"Hank's Bully",
      "description": "Hank gets bullied by a boy named Caleb, whose parents don't seem to mind that their son is pushing around an adult. Meanwhile, Dale and Peggy enter a taxidermy competition."
    },
    {
      "number": 15,
      "title": "Edu-macating Lucky",
      "description": "When Lucky asks Peggy to help him get his GED in the hopes of improving his chances of marrying Luanne, Peggy agrees to help him study for the test whilst being torn between her wish to help him and her wish to keep him away from her niece. He fails his GED, but the biggest shock comes after the results when Luanne announces she's pregnant with Lucky's child."
    }
  ],
  "11": [
    {
      "number": 1,
      "title": 	"The Peggy Horror Picture Show",
      "description": "Peggy, feeling a bit unfeminine because of her masculine clothes and size-16 feet, befriends Carolyn, who views Peggy as the epitome of womanhood. Hank is thrilled that Peggy finally has someone else to talk to about her girl problems, but discovers that Carolyn is a drag queen who thinks Peggy is one too."
    },
    {
      "number": 2,
      "title": 	"serPUNt",
      "description": "When a python Lucky gives to Bobby as a gift gets into the toilet, Hank calls on Tommy (guest-voiced by John Goodman) and Rollo at Animal Control for help. But instead of taking care of the problem, they make the city believe that the problem is worse than it is in order to get higher salaries, causing panic."
    },
    {
      "number": 3,
      "title": 	"Blood and Sauce",
      "description": "Bill is conflicted between keeping his family legacy alive and selling out when his effeminate cousin, Gilbert (last seen on 'A Beer Can Named Desire'), arrives to tell him that everyone in the Dauterive family is either dead, has gone insane, can't have children, or not blood-related and tries to stop him from selling his family's barbecue sauce recipe to Mr. Strickland."
    },
    {
      "number": 4,
      "title": 	"Luanne Gets Lucky",
      "description": "Lucky neglects Luanne when he becomes obsessed with retrieving a walnut tree stump his grandfather found, so Luanne accepts a 15-year-old's invitation to the senior prom (as her abusive parents kept her from going to the prom when she was a teenager)."
    },
    {
      "number": 5,
      "title": 	"Hank Gets Dusted",
      "description": "Hank is devastated when Cotton's Cadillac is given to Hank's cousin Dusty (voice of ZZ Top's Dusty Hill), but when Dusty and his bandmates show up at Hank's house to play practical jokes for a reality show taping, it is more than Hank can bear."
    },
    {
      "number": 6,
      "title": 		"Glen Peggy Glen Ross",
      "description": "Peggy is fired from The Arlen Bystander and begins a new career as a real estate agent. Meanwhile, after Dale buys a set of titanium golf clubs at a police auction, he gives the clubs to Hank, who does not want them after learning they were used as a murder weapon."
    },
    {
      "number": 7,
      "title": 		"The Passion of Dauterive",
      "description": "Bill searches for meaning in his life after surviving a roof collapse, leading to a relationship with Reverend Stroup."
    },
    {
      "number": 8,
      "title": "Grand Theft Arlen",
      "description": "Hank protests against a new school program that lets failing gym students play video games—and becomes addicted to Pro-Pain, a Grand Theft Auto knockoff centered on propane and featuring Hank as the protagonist. Meanwhile, Bobby trains for the Presidential Physical Fitness Test."
    },
    {
      "number": 9,
      "title": "Peggy's Gone to Pots",
      "description": "Peggy's attempts at selling houses in the gated community Arlen Heights lands her in trouble with a scam kitchen supply company after Peggy unwittingly takes Ted Wassanasong's wife's place as a saleslady. Meanwhile, Dale encounters the man whose name he's been using as an alias for years (Rusty Shackleford)."
    },
    {
      "number": 10,
      "title": "Hair Today, Gone Tomorrow",
      "description": "Nancy turns to her mother (voiced by Rue McClanahan) for help when the stress of home life and unresolved feelings for John Redcorn cause her to lose her hair. Meanwhile, Dale takes a ride with Kahn's delinquent nephew in a souped-up racecar during the vernal equinox and thinks he has traveled through time."
    },
    {
      "number": 11,
      "title": "Bill, Bulk and the Body Buddies",
      "description": "Bill meets a body builder named Dirk who agrees to help him train for an upcoming Army physical, but when Bill starts working out with Dirk and his two meathead buddies, Bill develops a bad attitude and alienates his former friends. Randy Savage guests as one of the bodybuilders."
    },
    {
      "number": 12,
      "title": "Lucky's Wedding Suit",
      "description": "When Lucky wants to give Luanne the expensive wedding that she desires, he sues Dale with a frivolous lawsuit after having an accident on the job. This was originally planned to be the final episode of the series."
    }
  ],
  "12": [
    {
      "number": 1,
      "title": "Suite Smells of Excess",
      "description": "When the guys take Bobby to a University of Texas football game their hijinks land them in a VIP box suite, where Hank is mistaken for a former player of the opposing Nebraska Cornhuskers, and is asked to call a crucial play for the team. Meanwhile, Peggy shops for a new TV after breaking the old one in a fit of rage."
    },
    {
      "number": 2,
      "title": 	"Bobby Rae",
      "description": "Bobby feigns interest in activism when he goes after the heart of a real student activist, who protests the installation of soda machines in the school (and the funds from said soda machines being used to pay for the teachers' vacation)."
    },
    {
      "number": 3,
      "title": 	"The Powder Puff Boys",
      "description": "Hank encourages Bobby to be a part of the school's Powder Puff team (a team where boys dress in drag and impersonate female cheerleaders). However, the boys learn that Peggy and the PTA are trying to put a stop to the tradition as they feel it's demeaning to women."
    },
    {
      "number": 4,
      "title": 		"Four Wave Intersection",
      "description": "Arlen is hit by a heat wave and Hank takes the kids to the water park. Unfortunately, they have to tangle with a group of surfer bullies to enjoy the 'Endless Wave.' Meanwhile, Boomhauer tries to regain his coolness after two sexy ladies laugh at him for wearing cutoff jeans, and Bill becomes a local celebrity known as the 'Heat Waver' after his car breaks down and he begins waving at passing motorists."
    },
    {
      "number": 5,
      "title": 		"Death Picks Cotton",
      "description": "While at a Japanese restaurant, Cotton suffers a war flashback and ends up getting hospitalized after falling on the grill and suffering from a shrimp allergy, where Peggy learns that Cotton may not have long to live."
    },
    {
      "number": 6,
      "title": 		"Raise the Steaks",
      "description": "After buying tough, unsavory steaks at the Mega-Lo-Mart, Hank, at Appleseed's suggestion, visits the town co-op in search of better meat. After falling in love with the delicious organic food, Hank becomes a co-op volunteer and co-owner, but his business skills causes the co-op to sell out to Mega Lo-Mart."
    },
    {
      "number": 7,
      "title": 	"Tears of an Inflatable Clown",
      "description": "Bobby's plans for a school carnival are ruined by a diversity expert who tricks the carnival committee into planning an assembly about racial and ethnic guilt. Meanwhile, Dale, Bill and Boomhauer try to get a reluctant Lucky to the hospital when he injures himself."
    },
    {
      "number": 8,
      "title": 	"The Minh Who Knew Too Much",
      "description": "Minh joins the Arlen Gun Club to learn skeet shooting, a skill she hopes will make an exclusive country club want her and Kahn as members. Meanwhile, Hank tries to solve the mystery of who's been discarding trash in his trash cans."
    },
    {
      "number": 9,
      "title": 		"Dream Weaver",
      "description": "Nancy wants Dale to get a new job since he is not making any money, so he and Hank go on a 'vocation vacation' to learn basket weaving. Meanwhile Peggy, Kahn and Bill try to achieve Internet stardom by creating a wacky viral video."
    },
    {
      "number": 10,
      "title": 		"Doggone Crazy",
      "description": "The Hill's dog, Ladybird, suddenly begins acting erratically and is put on a list of vicious dogs, and, if Hank doesn't hire a spiritualist to cure her, Ladybird will be euthanized."
    },
    {
      "number": 11,
      "title": 		"Trans-Fascism",
      "description": "When the Arlen City Council bans the sale of foods containing trans fats (along with rare burgers and raw oysters), Sugarfoot's Restaurant goes out of business. Strickland's solution to the problem is to sell his delicious, trans-fatty foods on a lunch truck so he can evade the law. Soon enough, other competitors come along, and with help from Nancy, Hank blackmails the town into repealing the food ban."
    },
    {
      "number": 12,
      "title": 		"Three Men and a Bastard",
      "description": "Bill becomes involved with a single mother, Charlene, who once had an affair with John Redcorn, and, like Nancy Gribble, has a half-Native American child who, like Joseph Gribble, is ignorant of her biological father's identity. Meanwhile, Joseph falls for Charlene's daughter, but everyone tries to keep him away from her as the two are related."
    },
    {
      "number": 13,
      "title": 	"The Accidental Terrorist",
      "description": "Hank finds out his car salesman has been tricking him into overpaying for vehicle purchases, and in pursuit of recourse, gets tangled (and nearly prosecuted) in a botched plan cooked up by two college-aged activists."
    },
    {
      "number": 14,
      "title": 		"Lady and Gentrification",
      "description": "Peggy inadvertently ruins Enrique's life when she sells a house in Enrique's neighborhood to a white hipster (voiced by Dax Shepard) who invites his hipster friends over to live in the same neighborhood. Meanwhile, Hank is asked to speak at Enrique's daughter Inez's quinceañera."
    },
    {
      "number": 15,
      "title": 	"Behind Closed Doors",
      "description": "Tom Landry Middle School holds an emergency community meeting when Dooley goes missing in Arlen run by relationship expert Stephen Davies, who calls Peggy out on not keeping her family tight-knit."
    },
    {
      "number": 16,
      "title": 	"Pour Some Sugar on Kahn",
      "description": "Kahn's father-in-law, General Gum, visits the Souphanousinphone family. The General gives Kahn a hard time and makes him feel like a failure. Kahn becomes depressed until he stumbles upon a Laotian karaoke bar where he becomes a star singing 'The Morning After'."
    },
    {
      "number": 17,
      "title": 	"Six Characters in Search of a House",
      "description": "Peggy brings in a family of struggling actors to sell a house currently occupied by the strangest family in Arlen, and ends up making the Hill house appealing to customers looking to buy a house."
    },
    {
      "number": 18,
      "title": 	"The Courtship of Joseph's Father",
      "description": "Joseph becomes the star quarterback at Tom Landry Middle School, and gives the school hope that they'll actually win this year -- until a wealthy prep school offers Joseph a chance to play for their school."
    },
    {
      "number": 19,
      "title": 		"Strangeness on a Train",
      "description": "Depressed over her past botched birthday parties, Peggy schedules a 1970s-style murder mystery party on a train, but when Dale ruins the surprise, thanks to Luanne's discovery of what her role is, a new mystery crops up — after Hank and Peg have sex in the train bathroom."
    },
    {
      "number": 20,
      "title": 		"Cops and Robert",
      "description": "When Hank accidentally steals another man's wallet (thinking that the man pickpocketed him), the man begins exacting his revenge on Hank. Meanwhile, Bobby gets sentenced to spend the day with the school security guard after being framed for throwing a soda can at him and Dale attempts to get a job at a Hooters-esque restaurant called 'Bazooms' by citing sexual discrimination if he is not hired. Paul Sorvino guest stars."
    },
    {
      "number": 21,
      "title": 	"It Came from the Garage",
      "description": "Hank and Bobby get in some father/son bonding time when Hank dumps the old team of Dale, Bill and Boomhauer to help Bobby in a boat-building competition. During the building process, Hank gets spooked by bats that invade the construction garage, forcing Bobby to do the building all alone."
    },
    {
      "number": 22,
      "title": 		"Life: A Loser's Manual",
      "description": "Luanne's father/Peggy's brother Hoyt (voiced by Johnny Knoxville) returns to Arlen to stay with the family. Once he arrives, Peggy reveals to Hank that Hoyt (who was apparently hiding on an oil rig from his ex-wife) is in truth a no-good ex-con and that the myth was meant to protect Luanne, who is oblivious and couldn't handle the truth if she ever had to. Hoyt attempts to corrupt everyone, especially Lucky, and convinces him to take the fall when Hoyt is arrested for possessing drugs. Peggy and Hank must then unite to save the day, by getting Hoyt arrested and getting Lucky to recant his confession."
    }
  ],
  "13": [
    {
      "number": 1,
      "title": 	"Dia-BILL-ic Shock",
      "description": "Bill, unwilling to change his sugary eating habits after collapsing from a blood sugar spike, is diagnosed with diabetes. When his first attempt to put it under control fails, a mean-spirited doctor tells him that he is going to lose his legs. After deciding to use a wheelchair (which he really does not need), he is befriended by a rugby player named Thunder, who teaches him how to be independent, but their friendship is strained when Thunder realizes Bill is not really disabled."
    },
    {
      "number": 2,
      "title": 	"Earthy Girls Are Easy",
      "description": "A local paper plans to run a story about Strickland Propane illegally dumping old propane tanks into the river. Hank suggests the company go green, and when the ladies of Arlen hear of the eco-efforts made by the company, Dale decides to help out Strickland with their carbon off-sets to garner the attention of the girls. To impress the ladies, Mr. Strickland organizes an Earth benefit concert that goes wrong."
    },
    {
      "number": 3,
      "title": 		"Square-Footed Monster",
      "description": "After Hank and the guys fix up the recently deceased Dotty Dwyer's house, Dotty's nephew sells the house to Ted Wassonasong. But when Ted has construction workers tear down the home to make way for a 'McMansion' (and Kahn discovers that Ted didn't build the house to move into it), the Hill family and the rest of the neighborhood visit the City Council to protest the construction and must team up to tear it down when it falls apart during a thunderstorm."
    },
    {
      "number": 4,
      "title": 	"Lost in MySpace",
      "description": "To boost business, Strickland Propane takes to advertising on the social media site MySpace, but when Donna is put in charge of creating the MySpace page, she uses the opportunity to make Strickland Propane look foolish and unprofessional. This eventually leads to Hank confronting Donna and she agrees to take down the negative content in exchange for him going easy on her. Meanwhile, Dale rents a pig to hunt truffles, loses it, and has to borrow Ladybird in order to track it down."
    },
    {
      "number": 5,
      "title": 	"No Bobby Left Behind",
      "description": "To raise the school's grade point average as part of the No Child Left Behind program, Bobby and Joseph are put into a 'special needs' class, which irks Hank, who believes his son's mediocre grades are from lack of trying. And things get worse when Principal Moss lets the 'special needs' kids go on a trip to Alamo Land on the same day as the honors students."
    },
    {
      "number": 6,
      "title": 	"A Bill Full of Dollars",
      "description": "After losing money in the stock market, Peggy, Minh, and Dale decide to study an average man (Bill) in order to find out what sells among people like him."
    },
    {
      "number": 7,
      "title": 		"Straight as an Arrow",
      "description": "When Bobby decides to become a member of the Order of the Straight Arrow (even though it was established that Bobby is already a member according to the season one episode 'Order of the Straight Arrow'), Hank decides to get involved as well, but when he bumps heads with the Arrowmaster, who happens to be a new resident of Arlen, Hank finds his teaching methods to be too childish, rather than being risky. Meanwhile, Lucky and Luanne shake their neighbors down for gifts after realizing no one gave them anything on their wedding day or their baby shower."
    },
    {
      "number": 8,
      "title": 		"Lucky See, Monkey Do",
      "description": "When Peggy plans a baby shower for Luanne, Lucky invites his sister Myrna and her children to the party. Myrna has conflicting parenting information to give Luanne, and is described by Peggy as a 'modern mother'. Meanwhile, Bill falls for a fast-food hotline operator's voice and travels to Arizona to find the woman behind the voice."
    },
    {
      "number": 9,
      "title": 	"What Happens at the National Propane Gas Convention in Memphis Stays at the National Propane Gas Convention in Memphis",
      "description": "When Buck Strickland is invited to the National Propane Gas Convention as the newest inductee into the Propane Hall of Flame, he asks Hank to accompany him. Although Hank is honored, he quickly realizes his primary responsibility will be babysitting Buck and preventing him from getting into trouble. Hank's job is made that much more difficult when Buck meets his illegitimate son Ray Roy (guest voice Diedrich Bader) at the convention and stays out late carousing with him."
    },
    {
      "number": 10,
      "title": 		"Master of Puppets",
      "description": "When Hank and Peggy forget to pick up Bobby at the mall, he begins using emotional blackmail to get them to do whatever he wants as revenge. Meanwhile, Dale camps out in the backyard after seeing a 'survive in the wild' reality show."
    },
    {
      "number": 11,
      "title": 	"Bwah My Nose",
      "description": "During a football game practice for an upcoming rematch, Bill breaks Hank's nose. After trying to live with the injury, Hank reluctantly gets plastic surgery...and becomes hung up on his looks."
    },
    {
      "number": 12,
      "title": 	"Uncool Customer",
      "description": "After Peggy finds out that she is not cool, she befriends one of Arlen's most glamorous and coolest moms in an effort to learn how to be cool. Meanwhile, Bobby joins a Cotillion class so he can be a proper gentleman and Hank finds a restaurant that sells delicious meatloaf sandwiches, but has a bizarre seating arrangement."
    },
    {
      "number": 13,
      "title": 		"Nancy Does Dallas",
      "description": "Nancy cheats and back-stabs her way to being top news anchor after being promoted to a Dallas station, and soon finds the ride downhill to be a bumpy one — especially when she appears at the Thanksgiving Day parade drunk. Meanwhile, Dale conducts a hare-brained experiment by turning the house into an igloo."
    },
    {
      "number": 14,
      "title": 		"Born Again on the Fourth of July",
      "description": "Hank gets involved in a neighborhood war over Independence Day decorations, while a misbehaving Bobby is scared into righteousness by a fire-and-brimstone preacher."
    },
    {
      "number": 15,
      "title": 	"Serves Me Right for Giving General George S. Patton the Bathroom Key",
      "description": "Hank receives a special delivery of his recently deceased father's personal belongings, including a list of bizarre final requests – one of which calls for Hank to flush Cotton's ashes in the toilet of a bar once used by General George S. Patton. Meanwhile, Dale and Bill bicker over an empty beer can Dale discarded in Bill's yard and will not pick up."
    },
    {
      "number": 16,
      "title": 		"Bad News Bill",
      "description": "When Hank tries to be realistic about Bobby's below-average baseball abilities, he is vilified by Bobby's over-enthusiastic Little League coach, who only wants to set Bobby up for disappointment. Meanwhile, Bill is hired as the head of the baseball field's snack counter."
    },
    {
      "number": 17,
      "title": 		"Manger Baby Einstein",
      "description": "While adjusting to her new career and life as a mom, Luanne resurrects her Manger Baby puppets and, with help from John Redcorn, starts a series of direct-to-DVD educational shows, but risks selling out when the franchise grows stale and other entertainers line up to take her place. Meanwhile, Dale writes a children's book about a lost bullet wanting to get home to find its gun."
    },
    {
      "number": 18,
      "title": 	"Uh-oh, Canada",
      "description": "Boomhauer vacations in Quebec and meets a beautiful French-Canadian woman. Meanwhile, a Canadian family living in Boomhauer's house for the summer irks Hank."
    },
    {
      "number": 19,
      "title": 	"The Boy Can't Help It",
      "description": "Bobby becomes quite the ladies' man when several girls in his class consider him a potential date for the Homecoming dance, but Hank is worried that Bobby is being used. Meanwhile, Hank and the guys try to put together the ultimate shopping cart for a local homeless man."
    },
    {
      "number": 20,
      "title": 	"The Honeymooners",
      "description": "Hank is shocked when his mother announces she is marrying a man she has only known for a few weeks and broke up with her longtime boyfriend. Soon after, the newlyweds celebrate by purchasing an RV and heading to Hank's. When Hank's mom and new stepfather have a heated argument, she takes off with the RV and Hank is left to rescue his mother once again."
    },
    {
      "number": 21,
      "title": 	"Bill Gathers Moss",
      "description": "Feeling lonely (and inspired by a cheesy sitcom about the wacky adventures of two roommates), Bill decides to take in roommates, but things take a turn for the worse when Bill is forced to take in a homeless Principal Moss (who recently lost his house and his car in a divorce and has been reduced to living in the school after hours, which Bobby and Joseph mistake for the paranormal activity of a dead homecoming queen), a former Playboy Bunny, and a Russian counterfeiter, who uses Moss to sell his wares at Tom Landry Middle School."
    },
    {
      "number": 22,
      "title": 	"When Joseph Met Lori, and Made Out with Her in the Janitor's Closet",
      "description": "Joseph goes out with a girl who wants their relationship to become physical and goes to Dale for advice, but Dale checks himself into a mental hospital to avoid giving his son the sex talk. Meanwhile, Nancy competes with her coworkers to find the most compelling human interest story to broadcast on the air."
    },
    {
      "number": 23,
      "title": 		"Just Another Manic Kahn-Day",
      "description": "Hank advises Kahn not to pick up his medication at the pharmacy, until he realizes that Kahn needs his medication to curb his manic-depressive mood swings, though Hank must choose between giving Kahn his medicine or exploiting his neighbor's manic energy in order to create a top-of-the-line grill. Meanwhile, Bobby tries to find the humor in a 'Raymond J. Johnson, Jr.' comedy record after his parents and other adults claim it is funny."
    },
    {
      "number": 24,
      "title": 	"To Sirloin with Love",
      "description": "Hank discovers that Bobby has a talent for inspecting and distinguishing cuts of beef (a skill Hank taught Bobby ever since he was a baby, but wasn't made apparent until now), and puts Bobby on a meat-inspecting team run by Heimlich County's community college."
    }
  ]
}
